Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x133e (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 26 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x853cd): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x80347): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x15082): C:/Users/Muhammad Ali khan/Desktop/LED_BLInking/Adc_nucleo/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 9 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x482c4): signed char
 <1><31>: Abbrev Number: 3 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x29ae7): __uint8_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 9 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x1d5d0): unsigned char
 <1><44>: Abbrev Number: 9 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x6b65f): short int
 <1><4b>: Abbrev Number: 3 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x75960): __uint16_t
    <50>   DW_AT_decl_file   : 3
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 9 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x89ae7): short unsigned int
 <1><5e>: Abbrev Number: 9 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xc0d0): long int
 <1><65>: Abbrev Number: 3 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x5b755): __uint32_t
    <6a>   DW_AT_decl_file   : 3
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 9 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x2bfab): long unsigned int
 <1><78>: Abbrev Number: 9 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x41293): long long int
 <1><7f>: Abbrev Number: 9 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x1dedd): long long unsigned int
 <1><86>: Abbrev Number: 27 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 9 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xba66): unsigned int
 <1><94>: Abbrev Number: 3 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x29ae9): uint8_t
    <99>   DW_AT_decl_file   : 4
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 24 (DW_TAG_const_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 3 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0x75962): uint16_t
    <aa>   DW_AT_decl_file   : 4
    <ab>   DW_AT_decl_line   : 36
    <ac>   DW_AT_decl_column : 20
    <ad>   DW_AT_type        : <0x4b>
 <1><b1>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <b2>   DW_AT_type        : <0xa5>
 <1><b6>: Abbrev Number: 3 (DW_TAG_typedef)
    <b7>   DW_AT_name        : (indirect string, offset: 0x5b757): uint32_t
    <bb>   DW_AT_decl_file   : 4
    <bc>   DW_AT_decl_line   : 48
    <bd>   DW_AT_decl_column : 20
    <be>   DW_AT_type        : <0x65>
 <1><c2>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <c3>   DW_AT_type        : <0xb6>
 <1><c7>: Abbrev Number: 18 (DW_TAG_array_type)
    <c8>   DW_AT_type        : <0xb6>
    <cc>   DW_AT_sibling     : <0xd7>
 <2><d0>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <d1>   DW_AT_type        : <0x8d>
    <d5>   DW_AT_upper_bound : 0
 <2><d6>: Abbrev Number: 0
 <1><d7>: Abbrev Number: 18 (DW_TAG_array_type)
    <d8>   DW_AT_type        : <0xb6>
    <dc>   DW_AT_sibling     : <0xe7>
 <2><e0>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <e1>   DW_AT_type        : <0x8d>
    <e5>   DW_AT_upper_bound : 1
 <2><e6>: Abbrev Number: 0
 <1><e7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <e8>   DW_AT_byte_size   : 80
    <e9>   DW_AT_decl_file   : 5
    <ea>   DW_AT_decl_line   : 151
    <eb>   DW_AT_decl_column : 9
    <eb>   DW_AT_sibling     : <0x1f2>
 <2><ef>: Abbrev Number: 10 (DW_TAG_member)
    <f0>   DW_AT_name        : SR
    <f3>   DW_AT_decl_file   : 5
    <f4>   DW_AT_decl_line   : 153
    <f5>   DW_AT_decl_column : 17
    <f6>   DW_AT_type        : <0xc2>
    <fa>   DW_AT_data_member_location: 0
 <2><fb>: Abbrev Number: 10 (DW_TAG_member)
    <fc>   DW_AT_name        : CR1
    <100>   DW_AT_decl_file   : 5
    <101>   DW_AT_decl_line   : 154
    <102>   DW_AT_decl_column : 17
    <103>   DW_AT_type        : <0xc2>
    <107>   DW_AT_data_member_location: 4
 <2><108>: Abbrev Number: 10 (DW_TAG_member)
    <109>   DW_AT_name        : CR2
    <10d>   DW_AT_decl_file   : 5
    <10e>   DW_AT_decl_line   : 155
    <10f>   DW_AT_decl_column : 17
    <110>   DW_AT_type        : <0xc2>
    <114>   DW_AT_data_member_location: 8
 <2><115>: Abbrev Number: 1 (DW_TAG_member)
    <116>   DW_AT_name        : (indirect string, offset: 0x8129b): SMPR1
    <11a>   DW_AT_decl_file   : 5
    <11b>   DW_AT_decl_line   : 156
    <11c>   DW_AT_decl_column : 17
    <11d>   DW_AT_type        : <0xc2>
    <121>   DW_AT_data_member_location: 12
 <2><122>: Abbrev Number: 1 (DW_TAG_member)
    <123>   DW_AT_name        : (indirect string, offset: 0x33237): SMPR2
    <127>   DW_AT_decl_file   : 5
    <128>   DW_AT_decl_line   : 157
    <129>   DW_AT_decl_column : 17
    <12a>   DW_AT_type        : <0xc2>
    <12e>   DW_AT_data_member_location: 16
 <2><12f>: Abbrev Number: 1 (DW_TAG_member)
    <130>   DW_AT_name        : (indirect string, offset: 0x316f8): JOFR1
    <134>   DW_AT_decl_file   : 5
    <135>   DW_AT_decl_line   : 158
    <136>   DW_AT_decl_column : 17
    <137>   DW_AT_type        : <0xc2>
    <13b>   DW_AT_data_member_location: 20
 <2><13c>: Abbrev Number: 1 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0x316fe): JOFR2
    <141>   DW_AT_decl_file   : 5
    <142>   DW_AT_decl_line   : 159
    <143>   DW_AT_decl_column : 17
    <144>   DW_AT_type        : <0xc2>
    <148>   DW_AT_data_member_location: 24
 <2><149>: Abbrev Number: 1 (DW_TAG_member)
    <14a>   DW_AT_name        : (indirect string, offset: 0x31704): JOFR3
    <14e>   DW_AT_decl_file   : 5
    <14f>   DW_AT_decl_line   : 160
    <150>   DW_AT_decl_column : 17
    <151>   DW_AT_type        : <0xc2>
    <155>   DW_AT_data_member_location: 28
 <2><156>: Abbrev Number: 1 (DW_TAG_member)
    <157>   DW_AT_name        : (indirect string, offset: 0x3170a): JOFR4
    <15b>   DW_AT_decl_file   : 5
    <15c>   DW_AT_decl_line   : 161
    <15d>   DW_AT_decl_column : 17
    <15e>   DW_AT_type        : <0xc2>
    <162>   DW_AT_data_member_location: 32
 <2><163>: Abbrev Number: 10 (DW_TAG_member)
    <164>   DW_AT_name        : HTR
    <168>   DW_AT_decl_file   : 5
    <169>   DW_AT_decl_line   : 162
    <16a>   DW_AT_decl_column : 17
    <16b>   DW_AT_type        : <0xc2>
    <16f>   DW_AT_data_member_location: 36
 <2><170>: Abbrev Number: 10 (DW_TAG_member)
    <171>   DW_AT_name        : LTR
    <175>   DW_AT_decl_file   : 5
    <176>   DW_AT_decl_line   : 163
    <177>   DW_AT_decl_column : 17
    <178>   DW_AT_type        : <0xc2>
    <17c>   DW_AT_data_member_location: 40
 <2><17d>: Abbrev Number: 1 (DW_TAG_member)
    <17e>   DW_AT_name        : (indirect string, offset: 0xc1a5): SQR1
    <182>   DW_AT_decl_file   : 5
    <183>   DW_AT_decl_line   : 164
    <184>   DW_AT_decl_column : 17
    <185>   DW_AT_type        : <0xc2>
    <189>   DW_AT_data_member_location: 44
 <2><18a>: Abbrev Number: 1 (DW_TAG_member)
    <18b>   DW_AT_name        : (indirect string, offset: 0xaf60): SQR2
    <18f>   DW_AT_decl_file   : 5
    <190>   DW_AT_decl_line   : 165
    <191>   DW_AT_decl_column : 17
    <192>   DW_AT_type        : <0xc2>
    <196>   DW_AT_data_member_location: 48
 <2><197>: Abbrev Number: 1 (DW_TAG_member)
    <198>   DW_AT_name        : (indirect string, offset: 0xaf65): SQR3
    <19c>   DW_AT_decl_file   : 5
    <19d>   DW_AT_decl_line   : 166
    <19e>   DW_AT_decl_column : 17
    <19f>   DW_AT_type        : <0xc2>
    <1a3>   DW_AT_data_member_location: 52
 <2><1a4>: Abbrev Number: 1 (DW_TAG_member)
    <1a5>   DW_AT_name        : (indirect string, offset: 0x6e7ba): JSQR
    <1a9>   DW_AT_decl_file   : 5
    <1aa>   DW_AT_decl_line   : 167
    <1ab>   DW_AT_decl_column : 17
    <1ac>   DW_AT_type        : <0xc2>
    <1b0>   DW_AT_data_member_location: 56
 <2><1b1>: Abbrev Number: 1 (DW_TAG_member)
    <1b2>   DW_AT_name        : (indirect string, offset: 0x5bf7a): JDR1
    <1b6>   DW_AT_decl_file   : 5
    <1b7>   DW_AT_decl_line   : 168
    <1b8>   DW_AT_decl_column : 17
    <1b9>   DW_AT_type        : <0xc2>
    <1bd>   DW_AT_data_member_location: 60
 <2><1be>: Abbrev Number: 1 (DW_TAG_member)
    <1bf>   DW_AT_name        : (indirect string, offset: 0x5bf7f): JDR2
    <1c3>   DW_AT_decl_file   : 5
    <1c4>   DW_AT_decl_line   : 169
    <1c5>   DW_AT_decl_column : 17
    <1c6>   DW_AT_type        : <0xc2>
    <1ca>   DW_AT_data_member_location: 64
 <2><1cb>: Abbrev Number: 1 (DW_TAG_member)
    <1cc>   DW_AT_name        : (indirect string, offset: 0x5bf84): JDR3
    <1d0>   DW_AT_decl_file   : 5
    <1d1>   DW_AT_decl_line   : 170
    <1d2>   DW_AT_decl_column : 17
    <1d3>   DW_AT_type        : <0xc2>
    <1d7>   DW_AT_data_member_location: 68
 <2><1d8>: Abbrev Number: 1 (DW_TAG_member)
    <1d9>   DW_AT_name        : (indirect string, offset: 0x263a2): JDR4
    <1dd>   DW_AT_decl_file   : 5
    <1de>   DW_AT_decl_line   : 171
    <1df>   DW_AT_decl_column : 17
    <1e0>   DW_AT_type        : <0xc2>
    <1e4>   DW_AT_data_member_location: 72
 <2><1e5>: Abbrev Number: 10 (DW_TAG_member)
    <1e6>   DW_AT_name        : DR
    <1e9>   DW_AT_decl_file   : 5
    <1ea>   DW_AT_decl_line   : 172
    <1eb>   DW_AT_decl_column : 17
    <1ec>   DW_AT_type        : <0xc2>
    <1f0>   DW_AT_data_member_location: 76
 <2><1f1>: Abbrev Number: 0
 <1><1f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <1f3>   DW_AT_name        : (indirect string, offset: 0x6e6d7): ADC_TypeDef
    <1f7>   DW_AT_decl_file   : 5
    <1f8>   DW_AT_decl_line   : 173
    <1f9>   DW_AT_decl_column : 3
    <1fa>   DW_AT_type        : <0xe7>
 <1><1fe>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1ff>   DW_AT_byte_size   : 24
    <200>   DW_AT_decl_file   : 5
    <201>   DW_AT_decl_line   : 213
    <202>   DW_AT_decl_column : 9
    <202>   DW_AT_sibling     : <0x254>
 <2><206>: Abbrev Number: 10 (DW_TAG_member)
    <207>   DW_AT_name        : CR
    <20a>   DW_AT_decl_file   : 5
    <20b>   DW_AT_decl_line   : 215
    <20c>   DW_AT_decl_column : 17
    <20d>   DW_AT_type        : <0xc2>
    <211>   DW_AT_data_member_location: 0
 <2><212>: Abbrev Number: 1 (DW_TAG_member)
    <213>   DW_AT_name        : (indirect string, offset: 0x46823): NDTR
    <217>   DW_AT_decl_file   : 5
    <218>   DW_AT_decl_line   : 216
    <219>   DW_AT_decl_column : 17
    <21a>   DW_AT_type        : <0xc2>
    <21e>   DW_AT_data_member_location: 4
 <2><21f>: Abbrev Number: 10 (DW_TAG_member)
    <220>   DW_AT_name        : PAR
    <224>   DW_AT_decl_file   : 5
    <225>   DW_AT_decl_line   : 217
    <226>   DW_AT_decl_column : 17
    <227>   DW_AT_type        : <0xc2>
    <22b>   DW_AT_data_member_location: 8
 <2><22c>: Abbrev Number: 1 (DW_TAG_member)
    <22d>   DW_AT_name        : (indirect string, offset: 0x3b482): M0AR
    <231>   DW_AT_decl_file   : 5
    <232>   DW_AT_decl_line   : 218
    <233>   DW_AT_decl_column : 17
    <234>   DW_AT_type        : <0xc2>
    <238>   DW_AT_data_member_location: 12
 <2><239>: Abbrev Number: 1 (DW_TAG_member)
    <23a>   DW_AT_name        : (indirect string, offset: 0xd8f5): M1AR
    <23e>   DW_AT_decl_file   : 5
    <23f>   DW_AT_decl_line   : 219
    <240>   DW_AT_decl_column : 17
    <241>   DW_AT_type        : <0xc2>
    <245>   DW_AT_data_member_location: 16
 <2><246>: Abbrev Number: 10 (DW_TAG_member)
    <247>   DW_AT_name        : FCR
    <24b>   DW_AT_decl_file   : 5
    <24c>   DW_AT_decl_line   : 220
    <24d>   DW_AT_decl_column : 17
    <24e>   DW_AT_type        : <0xc2>
    <252>   DW_AT_data_member_location: 20
 <2><253>: Abbrev Number: 0
 <1><254>: Abbrev Number: 3 (DW_TAG_typedef)
    <255>   DW_AT_name        : (indirect string, offset: 0x8294f): DMA_Stream_TypeDef
    <259>   DW_AT_decl_file   : 5
    <25a>   DW_AT_decl_line   : 221
    <25b>   DW_AT_decl_column : 3
    <25c>   DW_AT_type        : <0x1fe>
 <1><260>: Abbrev Number: 14 (DW_TAG_structure_type)
    <261>   DW_AT_byte_size   : 40
    <262>   DW_AT_decl_file   : 5
    <262>   DW_AT_decl_line   : 264
    <264>   DW_AT_decl_column : 9
    <264>   DW_AT_sibling     : <0x2db>
 <2><268>: Abbrev Number: 2 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0xfbc): MODER
    <26d>   DW_AT_decl_file   : 5
    <26d>   DW_AT_decl_line   : 266
    <26f>   DW_AT_decl_column : 17
    <270>   DW_AT_type        : <0xc2>
    <274>   DW_AT_data_member_location: 0
 <2><275>: Abbrev Number: 2 (DW_TAG_member)
    <276>   DW_AT_name        : (indirect string, offset: 0x6f4b0): OTYPER
    <27a>   DW_AT_decl_file   : 5
    <27a>   DW_AT_decl_line   : 267
    <27c>   DW_AT_decl_column : 17
    <27d>   DW_AT_type        : <0xc2>
    <281>   DW_AT_data_member_location: 4
 <2><282>: Abbrev Number: 2 (DW_TAG_member)
    <283>   DW_AT_name        : (indirect string, offset: 0x7d0d1): OSPEEDR
    <287>   DW_AT_decl_file   : 5
    <287>   DW_AT_decl_line   : 268
    <289>   DW_AT_decl_column : 17
    <28a>   DW_AT_type        : <0xc2>
    <28e>   DW_AT_data_member_location: 8
 <2><28f>: Abbrev Number: 2 (DW_TAG_member)
    <290>   DW_AT_name        : (indirect string, offset: 0x66942): PUPDR
    <294>   DW_AT_decl_file   : 5
    <294>   DW_AT_decl_line   : 269
    <296>   DW_AT_decl_column : 17
    <297>   DW_AT_type        : <0xc2>
    <29b>   DW_AT_data_member_location: 12
 <2><29c>: Abbrev Number: 6 (DW_TAG_member)
    <29d>   DW_AT_name        : IDR
    <2a1>   DW_AT_decl_file   : 5
    <2a1>   DW_AT_decl_line   : 270
    <2a3>   DW_AT_decl_column : 17
    <2a3>   DW_AT_type        : <0xc2>
    <2a7>   DW_AT_data_member_location: 16
 <2><2a8>: Abbrev Number: 6 (DW_TAG_member)
    <2a9>   DW_AT_name        : ODR
    <2ad>   DW_AT_decl_file   : 5
    <2ad>   DW_AT_decl_line   : 271
    <2af>   DW_AT_decl_column : 17
    <2af>   DW_AT_type        : <0xc2>
    <2b3>   DW_AT_data_member_location: 20
 <2><2b4>: Abbrev Number: 2 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x20540): BSRR
    <2b9>   DW_AT_decl_file   : 5
    <2b9>   DW_AT_decl_line   : 272
    <2bb>   DW_AT_decl_column : 17
    <2bc>   DW_AT_type        : <0xc2>
    <2c0>   DW_AT_data_member_location: 24
 <2><2c1>: Abbrev Number: 2 (DW_TAG_member)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x7b2c0): LCKR
    <2c6>   DW_AT_decl_file   : 5
    <2c6>   DW_AT_decl_line   : 273
    <2c8>   DW_AT_decl_column : 17
    <2c9>   DW_AT_type        : <0xc2>
    <2cd>   DW_AT_data_member_location: 28
 <2><2ce>: Abbrev Number: 6 (DW_TAG_member)
    <2cf>   DW_AT_name        : AFR
    <2d3>   DW_AT_decl_file   : 5
    <2d3>   DW_AT_decl_line   : 274
    <2d5>   DW_AT_decl_column : 17
    <2d5>   DW_AT_type        : <0x2eb>
    <2d9>   DW_AT_data_member_location: 32
 <2><2da>: Abbrev Number: 0
 <1><2db>: Abbrev Number: 18 (DW_TAG_array_type)
    <2dc>   DW_AT_type        : <0xc2>
    <2e0>   DW_AT_sibling     : <0x2eb>
 <2><2e4>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <2e5>   DW_AT_type        : <0x8d>
    <2e9>   DW_AT_upper_bound : 1
 <2><2ea>: Abbrev Number: 0
 <1><2eb>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <2ec>   DW_AT_type        : <0x2db>
 <1><2f0>: Abbrev Number: 15 (DW_TAG_typedef)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x8bbeb): GPIO_TypeDef
    <2f5>   DW_AT_decl_file   : 5
    <2f5>   DW_AT_decl_line   : 275
    <2f7>   DW_AT_decl_column : 3
    <2f7>   DW_AT_type        : <0x260>
 <1><2fb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <2fc>   DW_AT_byte_size   : 8
    <2fd>   DW_AT_decl_file   : 5
    <2fd>   DW_AT_decl_line   : 325
    <2ff>   DW_AT_decl_column : 9
    <2ff>   DW_AT_sibling     : <0x31b>
 <2><303>: Abbrev Number: 6 (DW_TAG_member)
    <304>   DW_AT_name        : CR
    <307>   DW_AT_decl_file   : 5
    <307>   DW_AT_decl_line   : 327
    <309>   DW_AT_decl_column : 17
    <309>   DW_AT_type        : <0xc2>
    <30d>   DW_AT_data_member_location: 0
 <2><30e>: Abbrev Number: 6 (DW_TAG_member)
    <30f>   DW_AT_name        : CSR
    <313>   DW_AT_decl_file   : 5
    <313>   DW_AT_decl_line   : 328
    <315>   DW_AT_decl_column : 17
    <315>   DW_AT_type        : <0xc2>
    <319>   DW_AT_data_member_location: 4
 <2><31a>: Abbrev Number: 0
 <1><31b>: Abbrev Number: 15 (DW_TAG_typedef)
    <31c>   DW_AT_name        : (indirect string, offset: 0x67dde): PWR_TypeDef
    <320>   DW_AT_decl_file   : 5
    <320>   DW_AT_decl_line   : 329
    <322>   DW_AT_decl_column : 3
    <322>   DW_AT_type        : <0x2fb>
 <1><326>: Abbrev Number: 14 (DW_TAG_structure_type)
    <327>   DW_AT_byte_size   : 144
    <328>   DW_AT_decl_file   : 5
    <328>   DW_AT_decl_line   : 335
    <32a>   DW_AT_decl_column : 9
    <32a>   DW_AT_sibling     : <0x4cb>
 <2><32e>: Abbrev Number: 6 (DW_TAG_member)
    <32f>   DW_AT_name        : CR
    <332>   DW_AT_decl_file   : 5
    <332>   DW_AT_decl_line   : 337
    <334>   DW_AT_decl_column : 17
    <334>   DW_AT_type        : <0xc2>
    <338>   DW_AT_data_member_location: 0
 <2><339>: Abbrev Number: 2 (DW_TAG_member)
    <33a>   DW_AT_name        : (indirect string, offset: 0x64600): PLLCFGR
    <33e>   DW_AT_decl_file   : 5
    <33e>   DW_AT_decl_line   : 338
    <340>   DW_AT_decl_column : 17
    <341>   DW_AT_type        : <0xc2>
    <345>   DW_AT_data_member_location: 4
 <2><346>: Abbrev Number: 2 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0x3e205): CFGR
    <34b>   DW_AT_decl_file   : 5
    <34b>   DW_AT_decl_line   : 339
    <34d>   DW_AT_decl_column : 17
    <34e>   DW_AT_type        : <0xc2>
    <352>   DW_AT_data_member_location: 8
 <2><353>: Abbrev Number: 6 (DW_TAG_member)
    <354>   DW_AT_name        : CIR
    <358>   DW_AT_decl_file   : 5
    <358>   DW_AT_decl_line   : 340
    <35a>   DW_AT_decl_column : 17
    <35a>   DW_AT_type        : <0xc2>
    <35e>   DW_AT_data_member_location: 12
 <2><35f>: Abbrev Number: 2 (DW_TAG_member)
    <360>   DW_AT_name        : (indirect string, offset: 0x72d8e): AHB1RSTR
    <364>   DW_AT_decl_file   : 5
    <364>   DW_AT_decl_line   : 341
    <366>   DW_AT_decl_column : 17
    <367>   DW_AT_type        : <0xc2>
    <36b>   DW_AT_data_member_location: 16
 <2><36c>: Abbrev Number: 2 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0x10827): AHB2RSTR
    <371>   DW_AT_decl_file   : 5
    <371>   DW_AT_decl_line   : 342
    <373>   DW_AT_decl_column : 17
    <374>   DW_AT_type        : <0xc2>
    <378>   DW_AT_data_member_location: 20
 <2><379>: Abbrev Number: 2 (DW_TAG_member)
    <37a>   DW_AT_name        : (indirect string, offset: 0x3e0db): AHB3RSTR
    <37e>   DW_AT_decl_file   : 5
    <37e>   DW_AT_decl_line   : 343
    <380>   DW_AT_decl_column : 17
    <381>   DW_AT_type        : <0xc2>
    <385>   DW_AT_data_member_location: 24
 <2><386>: Abbrev Number: 2 (DW_TAG_member)
    <387>   DW_AT_name        : (indirect string, offset: 0x8796c): RESERVED0
    <38b>   DW_AT_decl_file   : 5
    <38b>   DW_AT_decl_line   : 344
    <38d>   DW_AT_decl_column : 17
    <38e>   DW_AT_type        : <0xb6>
    <392>   DW_AT_data_member_location: 28
 <2><393>: Abbrev Number: 2 (DW_TAG_member)
    <394>   DW_AT_name        : (indirect string, offset: 0x10431): APB1RSTR
    <398>   DW_AT_decl_file   : 5
    <398>   DW_AT_decl_line   : 345
    <39a>   DW_AT_decl_column : 17
    <39b>   DW_AT_type        : <0xc2>
    <39f>   DW_AT_data_member_location: 32
 <2><3a0>: Abbrev Number: 2 (DW_TAG_member)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x3dc9c): APB2RSTR
    <3a5>   DW_AT_decl_file   : 5
    <3a5>   DW_AT_decl_line   : 346
    <3a7>   DW_AT_decl_column : 17
    <3a8>   DW_AT_type        : <0xc2>
    <3ac>   DW_AT_data_member_location: 36
 <2><3ad>: Abbrev Number: 2 (DW_TAG_member)
    <3ae>   DW_AT_name        : (indirect string, offset: 0x87976): RESERVED1
    <3b2>   DW_AT_decl_file   : 5
    <3b2>   DW_AT_decl_line   : 347
    <3b4>   DW_AT_decl_column : 17
    <3b5>   DW_AT_type        : <0xd7>
    <3b9>   DW_AT_data_member_location: 40
 <2><3ba>: Abbrev Number: 2 (DW_TAG_member)
    <3bb>   DW_AT_name        : (indirect string, offset: 0xb9fb): AHB1ENR
    <3bf>   DW_AT_decl_file   : 5
    <3bf>   DW_AT_decl_line   : 348
    <3c1>   DW_AT_decl_column : 17
    <3c2>   DW_AT_type        : <0xc2>
    <3c6>   DW_AT_data_member_location: 48
 <2><3c7>: Abbrev Number: 2 (DW_TAG_member)
    <3c8>   DW_AT_name        : (indirect string, offset: 0x26292): AHB2ENR
    <3cc>   DW_AT_decl_file   : 5
    <3cc>   DW_AT_decl_line   : 349
    <3ce>   DW_AT_decl_column : 17
    <3cf>   DW_AT_type        : <0xc2>
    <3d3>   DW_AT_data_member_location: 52
 <2><3d4>: Abbrev Number: 2 (DW_TAG_member)
    <3d5>   DW_AT_name        : (indirect string, offset: 0x3ffd8): AHB3ENR
    <3d9>   DW_AT_decl_file   : 5
    <3d9>   DW_AT_decl_line   : 350
    <3db>   DW_AT_decl_column : 17
    <3dc>   DW_AT_type        : <0xc2>
    <3e0>   DW_AT_data_member_location: 56
 <2><3e1>: Abbrev Number: 2 (DW_TAG_member)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x87980): RESERVED2
    <3e6>   DW_AT_decl_file   : 5
    <3e6>   DW_AT_decl_line   : 351
    <3e8>   DW_AT_decl_column : 17
    <3e9>   DW_AT_type        : <0xb6>
    <3ed>   DW_AT_data_member_location: 60
 <2><3ee>: Abbrev Number: 2 (DW_TAG_member)
    <3ef>   DW_AT_name        : (indirect string, offset: 0x6c768): APB1ENR
    <3f3>   DW_AT_decl_file   : 5
    <3f3>   DW_AT_decl_line   : 352
    <3f5>   DW_AT_decl_column : 17
    <3f6>   DW_AT_type        : <0xc2>
    <3fa>   DW_AT_data_member_location: 64
 <2><3fb>: Abbrev Number: 2 (DW_TAG_member)
    <3fc>   DW_AT_name        : (indirect string, offset: 0x10fc3): APB2ENR
    <400>   DW_AT_decl_file   : 5
    <400>   DW_AT_decl_line   : 353
    <402>   DW_AT_decl_column : 17
    <403>   DW_AT_type        : <0xc2>
    <407>   DW_AT_data_member_location: 68
 <2><408>: Abbrev Number: 2 (DW_TAG_member)
    <409>   DW_AT_name        : (indirect string, offset: 0x8798a): RESERVED3
    <40d>   DW_AT_decl_file   : 5
    <40d>   DW_AT_decl_line   : 354
    <40f>   DW_AT_decl_column : 17
    <410>   DW_AT_type        : <0xd7>
    <414>   DW_AT_data_member_location: 72
 <2><415>: Abbrev Number: 2 (DW_TAG_member)
    <416>   DW_AT_name        : (indirect string, offset: 0x475b3): AHB1LPENR
    <41a>   DW_AT_decl_file   : 5
    <41a>   DW_AT_decl_line   : 355
    <41c>   DW_AT_decl_column : 17
    <41d>   DW_AT_type        : <0xc2>
    <421>   DW_AT_data_member_location: 80
 <2><422>: Abbrev Number: 2 (DW_TAG_member)
    <423>   DW_AT_name        : (indirect string, offset: 0x201a6): AHB2LPENR
    <427>   DW_AT_decl_file   : 5
    <427>   DW_AT_decl_line   : 356
    <429>   DW_AT_decl_column : 17
    <42a>   DW_AT_type        : <0xc2>
    <42e>   DW_AT_data_member_location: 84
 <2><42f>: Abbrev Number: 2 (DW_TAG_member)
    <430>   DW_AT_name        : (indirect string, offset: 0x60de7): AHB3LPENR
    <434>   DW_AT_decl_file   : 5
    <434>   DW_AT_decl_line   : 357
    <436>   DW_AT_decl_column : 17
    <437>   DW_AT_type        : <0xc2>
    <43b>   DW_AT_data_member_location: 88
 <2><43c>: Abbrev Number: 2 (DW_TAG_member)
    <43d>   DW_AT_name        : (indirect string, offset: 0x87994): RESERVED4
    <441>   DW_AT_decl_file   : 5
    <441>   DW_AT_decl_line   : 358
    <443>   DW_AT_decl_column : 17
    <444>   DW_AT_type        : <0xb6>
    <448>   DW_AT_data_member_location: 92
 <2><449>: Abbrev Number: 2 (DW_TAG_member)
    <44a>   DW_AT_name        : (indirect string, offset: 0x5f4f5): APB1LPENR
    <44e>   DW_AT_decl_file   : 5
    <44e>   DW_AT_decl_line   : 359
    <450>   DW_AT_decl_column : 17
    <451>   DW_AT_type        : <0xc2>
    <455>   DW_AT_data_member_location: 96
 <2><456>: Abbrev Number: 2 (DW_TAG_member)
    <457>   DW_AT_name        : (indirect string, offset: 0xae5d): APB2LPENR
    <45b>   DW_AT_decl_file   : 5
    <45b>   DW_AT_decl_line   : 360
    <45d>   DW_AT_decl_column : 17
    <45e>   DW_AT_type        : <0xc2>
    <462>   DW_AT_data_member_location: 100
 <2><463>: Abbrev Number: 2 (DW_TAG_member)
    <464>   DW_AT_name        : (indirect string, offset: 0x8799e): RESERVED5
    <468>   DW_AT_decl_file   : 5
    <468>   DW_AT_decl_line   : 361
    <46a>   DW_AT_decl_column : 17
    <46b>   DW_AT_type        : <0xd7>
    <46f>   DW_AT_data_member_location: 104
 <2><470>: Abbrev Number: 2 (DW_TAG_member)
    <471>   DW_AT_name        : (indirect string, offset: 0x144b0): BDCR
    <475>   DW_AT_decl_file   : 5
    <475>   DW_AT_decl_line   : 362
    <477>   DW_AT_decl_column : 17
    <478>   DW_AT_type        : <0xc2>
    <47c>   DW_AT_data_member_location: 112
 <2><47d>: Abbrev Number: 6 (DW_TAG_member)
    <47e>   DW_AT_name        : CSR
    <482>   DW_AT_decl_file   : 5
    <482>   DW_AT_decl_line   : 363
    <484>   DW_AT_decl_column : 17
    <484>   DW_AT_type        : <0xc2>
    <488>   DW_AT_data_member_location: 116
 <2><489>: Abbrev Number: 2 (DW_TAG_member)
    <48a>   DW_AT_name        : (indirect string, offset: 0x879a8): RESERVED6
    <48e>   DW_AT_decl_file   : 5
    <48e>   DW_AT_decl_line   : 364
    <490>   DW_AT_decl_column : 17
    <491>   DW_AT_type        : <0xd7>
    <495>   DW_AT_data_member_location: 120
 <2><496>: Abbrev Number: 2 (DW_TAG_member)
    <497>   DW_AT_name        : (indirect string, offset: 0x4c5e8): SSCGR
    <49b>   DW_AT_decl_file   : 5
    <49b>   DW_AT_decl_line   : 365
    <49d>   DW_AT_decl_column : 17
    <49e>   DW_AT_type        : <0xc2>
    <4a2>   DW_AT_data_member_location: 128
 <2><4a3>: Abbrev Number: 2 (DW_TAG_member)
    <4a4>   DW_AT_name        : (indirect string, offset: 0x2f3ad): PLLI2SCFGR
    <4a8>   DW_AT_decl_file   : 5
    <4a8>   DW_AT_decl_line   : 366
    <4aa>   DW_AT_decl_column : 17
    <4ab>   DW_AT_type        : <0xc2>
    <4af>   DW_AT_data_member_location: 132
 <2><4b0>: Abbrev Number: 2 (DW_TAG_member)
    <4b1>   DW_AT_name        : (indirect string, offset: 0x879b2): RESERVED7
    <4b5>   DW_AT_decl_file   : 5
    <4b5>   DW_AT_decl_line   : 367
    <4b7>   DW_AT_decl_column : 17
    <4b8>   DW_AT_type        : <0xc7>
    <4bc>   DW_AT_data_member_location: 136
 <2><4bd>: Abbrev Number: 2 (DW_TAG_member)
    <4be>   DW_AT_name        : (indirect string, offset: 0x3e202): DCKCFGR
    <4c2>   DW_AT_decl_file   : 5
    <4c2>   DW_AT_decl_line   : 368
    <4c4>   DW_AT_decl_column : 17
    <4c5>   DW_AT_type        : <0xc2>
    <4c9>   DW_AT_data_member_location: 140
 <2><4ca>: Abbrev Number: 0
 <1><4cb>: Abbrev Number: 15 (DW_TAG_typedef)
    <4cc>   DW_AT_name        : (indirect string, offset: 0x4261f): RCC_TypeDef
    <4d0>   DW_AT_decl_file   : 5
    <4d0>   DW_AT_decl_line   : 369
    <4d2>   DW_AT_decl_column : 3
    <4d2>   DW_AT_type        : <0x326>
 <1><4d6>: Abbrev Number: 14 (DW_TAG_structure_type)
    <4d7>   DW_AT_byte_size   : 160
    <4d8>   DW_AT_decl_file   : 5
    <4d8>   DW_AT_decl_line   : 375
    <4da>   DW_AT_decl_column : 9
    <4da>   DW_AT_sibling     : <0x6de>
 <2><4de>: Abbrev Number: 6 (DW_TAG_member)
    <4df>   DW_AT_name        : TR
    <4e2>   DW_AT_decl_file   : 5
    <4e2>   DW_AT_decl_line   : 377
    <4e4>   DW_AT_decl_column : 17
    <4e4>   DW_AT_type        : <0xc2>
    <4e8>   DW_AT_data_member_location: 0
 <2><4e9>: Abbrev Number: 6 (DW_TAG_member)
    <4ea>   DW_AT_name        : DR
    <4ed>   DW_AT_decl_file   : 5
    <4ed>   DW_AT_decl_line   : 378
    <4ef>   DW_AT_decl_column : 17
    <4ef>   DW_AT_type        : <0xc2>
    <4f3>   DW_AT_data_member_location: 4
 <2><4f4>: Abbrev Number: 6 (DW_TAG_member)
    <4f5>   DW_AT_name        : CR
    <4f8>   DW_AT_decl_file   : 5
    <4f8>   DW_AT_decl_line   : 379
    <4fa>   DW_AT_decl_column : 17
    <4fa>   DW_AT_type        : <0xc2>
    <4fe>   DW_AT_data_member_location: 8
 <2><4ff>: Abbrev Number: 6 (DW_TAG_member)
    <500>   DW_AT_name        : ISR
    <504>   DW_AT_decl_file   : 5
    <504>   DW_AT_decl_line   : 380
    <506>   DW_AT_decl_column : 17
    <506>   DW_AT_type        : <0xc2>
    <50a>   DW_AT_data_member_location: 12
 <2><50b>: Abbrev Number: 2 (DW_TAG_member)
    <50c>   DW_AT_name        : (indirect string, offset: 0x5b98c): PRER
    <510>   DW_AT_decl_file   : 5
    <510>   DW_AT_decl_line   : 381
    <512>   DW_AT_decl_column : 17
    <513>   DW_AT_type        : <0xc2>
    <517>   DW_AT_data_member_location: 16
 <2><518>: Abbrev Number: 2 (DW_TAG_member)
    <519>   DW_AT_name        : (indirect string, offset: 0x34153): WUTR
    <51d>   DW_AT_decl_file   : 5
    <51d>   DW_AT_decl_line   : 382
    <51f>   DW_AT_decl_column : 17
    <520>   DW_AT_type        : <0xc2>
    <524>   DW_AT_data_member_location: 20
 <2><525>: Abbrev Number: 2 (DW_TAG_member)
    <526>   DW_AT_name        : (indirect string, offset: 0xab2a): CALIBR
    <52a>   DW_AT_decl_file   : 5
    <52a>   DW_AT_decl_line   : 383
    <52c>   DW_AT_decl_column : 17
    <52d>   DW_AT_type        : <0xc2>
    <531>   DW_AT_data_member_location: 24
 <2><532>: Abbrev Number: 2 (DW_TAG_member)
    <533>   DW_AT_name        : (indirect string, offset: 0x36e0d): ALRMAR
    <537>   DW_AT_decl_file   : 5
    <537>   DW_AT_decl_line   : 384
    <539>   DW_AT_decl_column : 17
    <53a>   DW_AT_type        : <0xc2>
    <53e>   DW_AT_data_member_location: 28
 <2><53f>: Abbrev Number: 2 (DW_TAG_member)
    <540>   DW_AT_name        : (indirect string, offset: 0x371b4): ALRMBR
    <544>   DW_AT_decl_file   : 5
    <544>   DW_AT_decl_line   : 385
    <546>   DW_AT_decl_column : 17
    <547>   DW_AT_type        : <0xc2>
    <54b>   DW_AT_data_member_location: 32
 <2><54c>: Abbrev Number: 6 (DW_TAG_member)
    <54d>   DW_AT_name        : WPR
    <551>   DW_AT_decl_file   : 5
    <551>   DW_AT_decl_line   : 386
    <553>   DW_AT_decl_column : 17
    <553>   DW_AT_type        : <0xc2>
    <557>   DW_AT_data_member_location: 36
 <2><558>: Abbrev Number: 6 (DW_TAG_member)
    <559>   DW_AT_name        : SSR
    <55d>   DW_AT_decl_file   : 5
    <55d>   DW_AT_decl_line   : 387
    <55f>   DW_AT_decl_column : 17
    <55f>   DW_AT_type        : <0xc2>
    <563>   DW_AT_data_member_location: 40
 <2><564>: Abbrev Number: 2 (DW_TAG_member)
    <565>   DW_AT_name        : (indirect string, offset: 0x3b47b): SHIFTR
    <569>   DW_AT_decl_file   : 5
    <569>   DW_AT_decl_line   : 388
    <56b>   DW_AT_decl_column : 17
    <56c>   DW_AT_type        : <0xc2>
    <570>   DW_AT_data_member_location: 44
 <2><571>: Abbrev Number: 2 (DW_TAG_member)
    <572>   DW_AT_name        : (indirect string, offset: 0x4ddc2): TSTR
    <576>   DW_AT_decl_file   : 5
    <576>   DW_AT_decl_line   : 389
    <578>   DW_AT_decl_column : 17
    <579>   DW_AT_type        : <0xc2>
    <57d>   DW_AT_data_member_location: 48
 <2><57e>: Abbrev Number: 2 (DW_TAG_member)
    <57f>   DW_AT_name        : (indirect string, offset: 0x491ca): TSDR
    <583>   DW_AT_decl_file   : 5
    <583>   DW_AT_decl_line   : 390
    <585>   DW_AT_decl_column : 17
    <586>   DW_AT_type        : <0xc2>
    <58a>   DW_AT_data_member_location: 52
 <2><58b>: Abbrev Number: 2 (DW_TAG_member)
    <58c>   DW_AT_name        : (indirect string, offset: 0x9d9a): TSSSR
    <590>   DW_AT_decl_file   : 5
    <590>   DW_AT_decl_line   : 391
    <592>   DW_AT_decl_column : 17
    <593>   DW_AT_type        : <0xc2>
    <597>   DW_AT_data_member_location: 56
 <2><598>: Abbrev Number: 2 (DW_TAG_member)
    <599>   DW_AT_name        : (indirect string, offset: 0x860e3): CALR
    <59d>   DW_AT_decl_file   : 5
    <59d>   DW_AT_decl_line   : 392
    <59f>   DW_AT_decl_column : 17
    <5a0>   DW_AT_type        : <0xc2>
    <5a4>   DW_AT_data_member_location: 60
 <2><5a5>: Abbrev Number: 2 (DW_TAG_member)
    <5a6>   DW_AT_name        : (indirect string, offset: 0x87fea): TAFCR
    <5aa>   DW_AT_decl_file   : 5
    <5aa>   DW_AT_decl_line   : 393
    <5ac>   DW_AT_decl_column : 17
    <5ad>   DW_AT_type        : <0xc2>
    <5b1>   DW_AT_data_member_location: 64
 <2><5b2>: Abbrev Number: 2 (DW_TAG_member)
    <5b3>   DW_AT_name        : (indirect string, offset: 0x2a6bd): ALRMASSR
    <5b7>   DW_AT_decl_file   : 5
    <5b7>   DW_AT_decl_line   : 394
    <5b9>   DW_AT_decl_column : 17
    <5ba>   DW_AT_type        : <0xc2>
    <5be>   DW_AT_data_member_location: 68
 <2><5bf>: Abbrev Number: 2 (DW_TAG_member)
    <5c0>   DW_AT_name        : (indirect string, offset: 0x4554c): ALRMBSSR
    <5c4>   DW_AT_decl_file   : 5
    <5c4>   DW_AT_decl_line   : 395
    <5c6>   DW_AT_decl_column : 17
    <5c7>   DW_AT_type        : <0xc2>
    <5cb>   DW_AT_data_member_location: 72
 <2><5cc>: Abbrev Number: 2 (DW_TAG_member)
    <5cd>   DW_AT_name        : (indirect string, offset: 0x879b2): RESERVED7
    <5d1>   DW_AT_decl_file   : 5
    <5d1>   DW_AT_decl_line   : 396
    <5d3>   DW_AT_decl_column : 12
    <5d4>   DW_AT_type        : <0xb6>
    <5d8>   DW_AT_data_member_location: 76
 <2><5d9>: Abbrev Number: 2 (DW_TAG_member)
    <5da>   DW_AT_name        : (indirect string, offset: 0x3226c): BKP0R
    <5de>   DW_AT_decl_file   : 5
    <5de>   DW_AT_decl_line   : 397
    <5e0>   DW_AT_decl_column : 17
    <5e1>   DW_AT_type        : <0xc2>
    <5e5>   DW_AT_data_member_location: 80
 <2><5e6>: Abbrev Number: 2 (DW_TAG_member)
    <5e7>   DW_AT_name        : (indirect string, offset: 0x85a39): BKP1R
    <5eb>   DW_AT_decl_file   : 5
    <5eb>   DW_AT_decl_line   : 398
    <5ed>   DW_AT_decl_column : 17
    <5ee>   DW_AT_type        : <0xc2>
    <5f2>   DW_AT_data_member_location: 84
 <2><5f3>: Abbrev Number: 2 (DW_TAG_member)
    <5f4>   DW_AT_name        : (indirect string, offset: 0x329f8): BKP2R
    <5f8>   DW_AT_decl_file   : 5
    <5f8>   DW_AT_decl_line   : 399
    <5fa>   DW_AT_decl_column : 17
    <5fb>   DW_AT_type        : <0xc2>
    <5ff>   DW_AT_data_member_location: 88
 <2><600>: Abbrev Number: 2 (DW_TAG_member)
    <601>   DW_AT_name        : (indirect string, offset: 0x32d9f): BKP3R
    <605>   DW_AT_decl_file   : 5
    <605>   DW_AT_decl_line   : 400
    <607>   DW_AT_decl_column : 17
    <608>   DW_AT_type        : <0xc2>
    <60c>   DW_AT_data_member_location: 92
 <2><60d>: Abbrev Number: 2 (DW_TAG_member)
    <60e>   DW_AT_name        : (indirect string, offset: 0x87778): BKP4R
    <612>   DW_AT_decl_file   : 5
    <612>   DW_AT_decl_line   : 401
    <614>   DW_AT_decl_column : 17
    <615>   DW_AT_type        : <0xc2>
    <619>   DW_AT_data_member_location: 96
 <2><61a>: Abbrev Number: 2 (DW_TAG_member)
    <61b>   DW_AT_name        : (indirect string, offset: 0x87f64): BKP5R
    <61f>   DW_AT_decl_file   : 5
    <61f>   DW_AT_decl_line   : 402
    <621>   DW_AT_decl_column : 17
    <622>   DW_AT_type        : <0xc2>
    <626>   DW_AT_data_member_location: 100
 <2><627>: Abbrev Number: 2 (DW_TAG_member)
    <628>   DW_AT_name        : (indirect string, offset: 0x8891c): BKP6R
    <62c>   DW_AT_decl_file   : 5
    <62c>   DW_AT_decl_line   : 403
    <62e>   DW_AT_decl_column : 17
    <62f>   DW_AT_type        : <0xc2>
    <633>   DW_AT_data_member_location: 104
 <2><634>: Abbrev Number: 2 (DW_TAG_member)
    <635>   DW_AT_name        : (indirect string, offset: 0x33f67): BKP7R
    <639>   DW_AT_decl_file   : 5
    <639>   DW_AT_decl_line   : 404
    <63b>   DW_AT_decl_column : 17
    <63c>   DW_AT_type        : <0xc2>
    <640>   DW_AT_data_member_location: 108
 <2><641>: Abbrev Number: 2 (DW_TAG_member)
    <642>   DW_AT_name        : (indirect string, offset: 0x89a40): BKP8R
    <646>   DW_AT_decl_file   : 5
    <646>   DW_AT_decl_line   : 405
    <648>   DW_AT_decl_column : 17
    <649>   DW_AT_type        : <0xc2>
    <64d>   DW_AT_data_member_location: 112
 <2><64e>: Abbrev Number: 2 (DW_TAG_member)
    <64f>   DW_AT_name        : (indirect string, offset: 0x34c44): BKP9R
    <653>   DW_AT_decl_file   : 5
    <653>   DW_AT_decl_line   : 406
    <655>   DW_AT_decl_column : 17
    <656>   DW_AT_type        : <0xc2>
    <65a>   DW_AT_data_member_location: 116
 <2><65b>: Abbrev Number: 2 (DW_TAG_member)
    <65c>   DW_AT_name        : (indirect string, offset: 0x3b0a6): BKP10R
    <660>   DW_AT_decl_file   : 5
    <660>   DW_AT_decl_line   : 407
    <662>   DW_AT_decl_column : 17
    <663>   DW_AT_type        : <0xc2>
    <667>   DW_AT_data_member_location: 120
 <2><668>: Abbrev Number: 2 (DW_TAG_member)
    <669>   DW_AT_name        : (indirect string, offset: 0x219c4): BKP11R
    <66d>   DW_AT_decl_file   : 5
    <66d>   DW_AT_decl_line   : 408
    <66f>   DW_AT_decl_column : 17
    <670>   DW_AT_type        : <0xc2>
    <674>   DW_AT_data_member_location: 124
 <2><675>: Abbrev Number: 2 (DW_TAG_member)
    <676>   DW_AT_name        : (indirect string, offset: 0x3143): BKP12R
    <67a>   DW_AT_decl_file   : 5
    <67a>   DW_AT_decl_line   : 409
    <67c>   DW_AT_decl_column : 17
    <67d>   DW_AT_type        : <0xc2>
    <681>   DW_AT_data_member_location: 128
 <2><682>: Abbrev Number: 2 (DW_TAG_member)
    <683>   DW_AT_name        : (indirect string, offset: 0x22308): BKP13R
    <687>   DW_AT_decl_file   : 5
    <687>   DW_AT_decl_line   : 410
    <689>   DW_AT_decl_column : 17
    <68a>   DW_AT_type        : <0xc2>
    <68e>   DW_AT_data_member_location: 132
 <2><68f>: Abbrev Number: 2 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x78e11): BKP14R
    <694>   DW_AT_decl_file   : 5
    <694>   DW_AT_decl_line   : 411
    <696>   DW_AT_decl_column : 17
    <697>   DW_AT_type        : <0xc2>
    <69b>   DW_AT_data_member_location: 136
 <2><69c>: Abbrev Number: 2 (DW_TAG_member)
    <69d>   DW_AT_name        : (indirect string, offset: 0x3f58e): BKP15R
    <6a1>   DW_AT_decl_file   : 5
    <6a1>   DW_AT_decl_line   : 412
    <6a3>   DW_AT_decl_column : 17
    <6a4>   DW_AT_type        : <0xc2>
    <6a8>   DW_AT_data_member_location: 140
 <2><6a9>: Abbrev Number: 2 (DW_TAG_member)
    <6aa>   DW_AT_name        : (indirect string, offset: 0x22df0): BKP16R
    <6ae>   DW_AT_decl_file   : 5
    <6ae>   DW_AT_decl_line   : 413
    <6b0>   DW_AT_decl_column : 17
    <6b1>   DW_AT_type        : <0xc2>
    <6b5>   DW_AT_data_member_location: 144
 <2><6b6>: Abbrev Number: 2 (DW_TAG_member)
    <6b7>   DW_AT_name        : (indirect string, offset: 0x232fd): BKP17R
    <6bb>   DW_AT_decl_file   : 5
    <6bb>   DW_AT_decl_line   : 414
    <6bd>   DW_AT_decl_column : 17
    <6be>   DW_AT_type        : <0xc2>
    <6c2>   DW_AT_data_member_location: 148
 <2><6c3>: Abbrev Number: 2 (DW_TAG_member)
    <6c4>   DW_AT_name        : (indirect string, offset: 0x7b0ef): BKP18R
    <6c8>   DW_AT_decl_file   : 5
    <6c8>   DW_AT_decl_line   : 415
    <6ca>   DW_AT_decl_column : 17
    <6cb>   DW_AT_type        : <0xc2>
    <6cf>   DW_AT_data_member_location: 152
 <2><6d0>: Abbrev Number: 2 (DW_TAG_member)
    <6d1>   DW_AT_name        : (indirect string, offset: 0x24067): BKP19R
    <6d5>   DW_AT_decl_file   : 5
    <6d5>   DW_AT_decl_line   : 416
    <6d7>   DW_AT_decl_column : 17
    <6d8>   DW_AT_type        : <0xc2>
    <6dc>   DW_AT_data_member_location: 156
 <2><6dd>: Abbrev Number: 0
 <1><6de>: Abbrev Number: 15 (DW_TAG_typedef)
    <6df>   DW_AT_name        : (indirect string, offset: 0x771e): RTC_TypeDef
    <6e3>   DW_AT_decl_file   : 5
    <6e3>   DW_AT_decl_line   : 417
    <6e5>   DW_AT_decl_column : 3
    <6e5>   DW_AT_type        : <0x4d6>
 <1><6e9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <6ea>   DW_AT_byte_size   : 28
    <6eb>   DW_AT_decl_file   : 5
    <6eb>   DW_AT_decl_line   : 498
    <6ed>   DW_AT_decl_column : 9
    <6ed>   DW_AT_sibling     : <0x745>
 <2><6f1>: Abbrev Number: 6 (DW_TAG_member)
    <6f2>   DW_AT_name        : SR
    <6f5>   DW_AT_decl_file   : 5
    <6f5>   DW_AT_decl_line   : 500
    <6f7>   DW_AT_decl_column : 17
    <6f7>   DW_AT_type        : <0xc2>
    <6fb>   DW_AT_data_member_location: 0
 <2><6fc>: Abbrev Number: 6 (DW_TAG_member)
    <6fd>   DW_AT_name        : DR
    <700>   DW_AT_decl_file   : 5
    <700>   DW_AT_decl_line   : 501
    <702>   DW_AT_decl_column : 17
    <702>   DW_AT_type        : <0xc2>
    <706>   DW_AT_data_member_location: 4
 <2><707>: Abbrev Number: 6 (DW_TAG_member)
    <708>   DW_AT_name        : BRR
    <70c>   DW_AT_decl_file   : 5
    <70c>   DW_AT_decl_line   : 502
    <70e>   DW_AT_decl_column : 17
    <70e>   DW_AT_type        : <0xc2>
    <712>   DW_AT_data_member_location: 8
 <2><713>: Abbrev Number: 6 (DW_TAG_member)
    <714>   DW_AT_name        : CR1
    <718>   DW_AT_decl_file   : 5
    <718>   DW_AT_decl_line   : 503
    <71a>   DW_AT_decl_column : 17
    <71a>   DW_AT_type        : <0xc2>
    <71e>   DW_AT_data_member_location: 12
 <2><71f>: Abbrev Number: 6 (DW_TAG_member)
    <720>   DW_AT_name        : CR2
    <724>   DW_AT_decl_file   : 5
    <724>   DW_AT_decl_line   : 504
    <726>   DW_AT_decl_column : 17
    <726>   DW_AT_type        : <0xc2>
    <72a>   DW_AT_data_member_location: 16
 <2><72b>: Abbrev Number: 6 (DW_TAG_member)
    <72c>   DW_AT_name        : CR3
    <730>   DW_AT_decl_file   : 5
    <730>   DW_AT_decl_line   : 505
    <732>   DW_AT_decl_column : 17
    <732>   DW_AT_type        : <0xc2>
    <736>   DW_AT_data_member_location: 20
 <2><737>: Abbrev Number: 2 (DW_TAG_member)
    <738>   DW_AT_name        : (indirect string, offset: 0x2800d): GTPR
    <73c>   DW_AT_decl_file   : 5
    <73c>   DW_AT_decl_line   : 506
    <73e>   DW_AT_decl_column : 17
    <73f>   DW_AT_type        : <0xc2>
    <743>   DW_AT_data_member_location: 24
 <2><744>: Abbrev Number: 0
 <1><745>: Abbrev Number: 15 (DW_TAG_typedef)
    <746>   DW_AT_name        : (indirect string, offset: 0x8e965): USART_TypeDef
    <74a>   DW_AT_decl_file   : 5
    <74a>   DW_AT_decl_line   : 507
    <74c>   DW_AT_decl_column : 3
    <74c>   DW_AT_type        : <0x6e9>
 <1><750>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <751>   DW_AT_encoding    : 7	(unsigned)
    <751>   DW_AT_byte_size   : 1
    <751>   DW_AT_type        : <0x3d>
    <755>   DW_AT_decl_file   : 6
    <756>   DW_AT_decl_line   : 191
    <757>   DW_AT_decl_column : 1
    <757>   DW_AT_sibling     : <0x768>
 <2><75b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <75c>   DW_AT_name        : (indirect string, offset: 0x444c7): DISABLE
    <760>   DW_AT_const_value : 0
 <2><761>: Abbrev Number: 4 (DW_TAG_enumerator)
    <762>   DW_AT_name        : (indirect string, offset: 0x82d85): ENABLE
    <766>   DW_AT_const_value : 1
 <2><767>: Abbrev Number: 0
 <1><768>: Abbrev Number: 3 (DW_TAG_typedef)
    <769>   DW_AT_name        : (indirect string, offset: 0x8f0e4): FunctionalState
    <76d>   DW_AT_decl_file   : 6
    <76e>   DW_AT_decl_line   : 194
    <76f>   DW_AT_decl_column : 3
    <770>   DW_AT_type        : <0x750>
 <1><774>: Abbrev Number: 9 (DW_TAG_base_type)
    <775>   DW_AT_byte_size   : 8
    <776>   DW_AT_encoding    : 4	(float)
    <777>   DW_AT_name        : (indirect string, offset: 0x90d1a): long double
 <1><77b>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <77c>   DW_AT_encoding    : 7	(unsigned)
    <77c>   DW_AT_byte_size   : 1
    <77c>   DW_AT_type        : <0x3d>
    <780>   DW_AT_decl_file   : 7
    <781>   DW_AT_decl_line   : 39
    <782>   DW_AT_decl_column : 1
    <782>   DW_AT_sibling     : <0x79f>
 <2><786>: Abbrev Number: 4 (DW_TAG_enumerator)
    <787>   DW_AT_name        : (indirect string, offset: 0x302d0): HAL_OK
    <78b>   DW_AT_const_value : 0
 <2><78c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <78d>   DW_AT_name        : (indirect string, offset: 0x59f84): HAL_ERROR
    <791>   DW_AT_const_value : 1
 <2><792>: Abbrev Number: 4 (DW_TAG_enumerator)
    <793>   DW_AT_name        : (indirect string, offset: 0x782c7): HAL_BUSY
    <797>   DW_AT_const_value : 2
 <2><798>: Abbrev Number: 4 (DW_TAG_enumerator)
    <799>   DW_AT_name        : (indirect string, offset: 0x29fd5): HAL_TIMEOUT
    <79d>   DW_AT_const_value : 3
 <2><79e>: Abbrev Number: 0
 <1><79f>: Abbrev Number: 3 (DW_TAG_typedef)
    <7a0>   DW_AT_name        : (indirect string, offset: 0x81163): HAL_StatusTypeDef
    <7a4>   DW_AT_decl_file   : 7
    <7a5>   DW_AT_decl_line   : 44
    <7a6>   DW_AT_decl_column : 3
    <7a7>   DW_AT_type        : <0x77b>
 <1><7ab>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <7ac>   DW_AT_encoding    : 7	(unsigned)
    <7ac>   DW_AT_byte_size   : 1
    <7ac>   DW_AT_type        : <0x3d>
    <7b0>   DW_AT_decl_file   : 7
    <7b1>   DW_AT_decl_line   : 50
    <7b2>   DW_AT_decl_column : 1
    <7b2>   DW_AT_sibling     : <0x7c3>
 <2><7b6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7b7>   DW_AT_name        : (indirect string, offset: 0x6a9fe): HAL_UNLOCKED
    <7bb>   DW_AT_const_value : 0
 <2><7bc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7bd>   DW_AT_name        : (indirect string, offset: 0x8fa4c): HAL_LOCKED
    <7c1>   DW_AT_const_value : 1
 <2><7c2>: Abbrev Number: 0
 <1><7c3>: Abbrev Number: 3 (DW_TAG_typedef)
    <7c4>   DW_AT_name        : (indirect string, offset: 0x57c68): HAL_LockTypeDef
    <7c8>   DW_AT_decl_file   : 7
    <7c9>   DW_AT_decl_line   : 53
    <7ca>   DW_AT_decl_column : 3
    <7cb>   DW_AT_type        : <0x7ab>
 <1><7cf>: Abbrev Number: 8 (DW_TAG_structure_type)
    <7d0>   DW_AT_byte_size   : 24
    <7d1>   DW_AT_decl_file   : 8
    <7d2>   DW_AT_decl_line   : 45
    <7d3>   DW_AT_decl_column : 9
    <7d3>   DW_AT_sibling     : <0x826>
 <2><7d7>: Abbrev Number: 1 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x5ffe7): PLLState
    <7dc>   DW_AT_decl_file   : 8
    <7dd>   DW_AT_decl_line   : 47
    <7de>   DW_AT_decl_column : 12
    <7df>   DW_AT_type        : <0xb6>
    <7e3>   DW_AT_data_member_location: 0
 <2><7e4>: Abbrev Number: 1 (DW_TAG_member)
    <7e5>   DW_AT_name        : (indirect string, offset: 0x61318): PLLSource
    <7e9>   DW_AT_decl_file   : 8
    <7ea>   DW_AT_decl_line   : 50
    <7eb>   DW_AT_decl_column : 12
    <7ec>   DW_AT_type        : <0xb6>
    <7f0>   DW_AT_data_member_location: 4
 <2><7f1>: Abbrev Number: 1 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0x77419): PLLM
    <7f6>   DW_AT_decl_file   : 8
    <7f7>   DW_AT_decl_line   : 53
    <7f8>   DW_AT_decl_column : 12
    <7f9>   DW_AT_type        : <0xb6>
    <7fd>   DW_AT_data_member_location: 8
 <2><7fe>: Abbrev Number: 1 (DW_TAG_member)
    <7ff>   DW_AT_name        : (indirect string, offset: 0x7741e): PLLN
    <803>   DW_AT_decl_file   : 8
    <804>   DW_AT_decl_line   : 56
    <805>   DW_AT_decl_column : 12
    <806>   DW_AT_type        : <0xb6>
    <80a>   DW_AT_data_member_location: 12
 <2><80b>: Abbrev Number: 1 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0x42886): PLLP
    <810>   DW_AT_decl_file   : 8
    <811>   DW_AT_decl_line   : 60
    <812>   DW_AT_decl_column : 12
    <813>   DW_AT_type        : <0xb6>
    <817>   DW_AT_data_member_location: 16
 <2><818>: Abbrev Number: 1 (DW_TAG_member)
    <819>   DW_AT_name        : (indirect string, offset: 0x353ee): PLLQ
    <81d>   DW_AT_decl_file   : 8
    <81e>   DW_AT_decl_line   : 63
    <81f>   DW_AT_decl_column : 12
    <820>   DW_AT_type        : <0xb6>
    <824>   DW_AT_data_member_location: 20
 <2><825>: Abbrev Number: 0
 <1><826>: Abbrev Number: 3 (DW_TAG_typedef)
    <827>   DW_AT_name        : (indirect string, offset: 0x8d31f): RCC_PLLInitTypeDef
    <82b>   DW_AT_decl_file   : 8
    <82c>   DW_AT_decl_line   : 73
    <82d>   DW_AT_decl_column : 2
    <82e>   DW_AT_type        : <0x7cf>
 <1><832>: Abbrev Number: 8 (DW_TAG_structure_type)
    <833>   DW_AT_byte_size   : 48
    <834>   DW_AT_decl_file   : 9
    <835>   DW_AT_decl_line   : 49
    <836>   DW_AT_decl_column : 9
    <836>   DW_AT_sibling     : <0x896>
 <2><83a>: Abbrev Number: 1 (DW_TAG_member)
    <83b>   DW_AT_name        : (indirect string, offset: 0x753a1): OscillatorType
    <83f>   DW_AT_decl_file   : 9
    <840>   DW_AT_decl_line   : 51
    <841>   DW_AT_decl_column : 12
    <842>   DW_AT_type        : <0xb6>
    <846>   DW_AT_data_member_location: 0
 <2><847>: Abbrev Number: 1 (DW_TAG_member)
    <848>   DW_AT_name        : (indirect string, offset: 0x6119c): HSEState
    <84c>   DW_AT_decl_file   : 9
    <84d>   DW_AT_decl_line   : 54
    <84e>   DW_AT_decl_column : 12
    <84f>   DW_AT_type        : <0xb6>
    <853>   DW_AT_data_member_location: 4
 <2><854>: Abbrev Number: 1 (DW_TAG_member)
    <855>   DW_AT_name        : (indirect string, offset: 0x5a56b): LSEState
    <859>   DW_AT_decl_file   : 9
    <85a>   DW_AT_decl_line   : 57
    <85b>   DW_AT_decl_column : 12
    <85c>   DW_AT_type        : <0xb6>
    <860>   DW_AT_data_member_location: 8
 <2><861>: Abbrev Number: 1 (DW_TAG_member)
    <862>   DW_AT_name        : (indirect string, offset: 0x3f961): HSIState
    <866>   DW_AT_decl_file   : 9
    <867>   DW_AT_decl_line   : 60
    <868>   DW_AT_decl_column : 12
    <869>   DW_AT_type        : <0xb6>
    <86d>   DW_AT_data_member_location: 12
 <2><86e>: Abbrev Number: 1 (DW_TAG_member)
    <86f>   DW_AT_name        : (indirect string, offset: 0x7b8ef): HSICalibrationValue
    <873>   DW_AT_decl_file   : 9
    <874>   DW_AT_decl_line   : 63
    <875>   DW_AT_decl_column : 12
    <876>   DW_AT_type        : <0xb6>
    <87a>   DW_AT_data_member_location: 16
 <2><87b>: Abbrev Number: 1 (DW_TAG_member)
    <87c>   DW_AT_name        : (indirect string, offset: 0x806c3): LSIState
    <880>   DW_AT_decl_file   : 9
    <881>   DW_AT_decl_line   : 66
    <882>   DW_AT_decl_column : 12
    <883>   DW_AT_type        : <0xb6>
    <887>   DW_AT_data_member_location: 20
 <2><888>: Abbrev Number: 10 (DW_TAG_member)
    <889>   DW_AT_name        : PLL
    <88d>   DW_AT_decl_file   : 9
    <88e>   DW_AT_decl_line   : 69
    <88f>   DW_AT_decl_column : 22
    <890>   DW_AT_type        : <0x826>
    <894>   DW_AT_data_member_location: 24
 <2><895>: Abbrev Number: 0
 <1><896>: Abbrev Number: 3 (DW_TAG_typedef)
    <897>   DW_AT_name        : (indirect string, offset: 0x4ca98): RCC_OscInitTypeDef
    <89b>   DW_AT_decl_file   : 9
    <89c>   DW_AT_decl_line   : 70
    <89d>   DW_AT_decl_column : 2
    <89e>   DW_AT_type        : <0x832>
 <1><8a2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8a3>   DW_AT_byte_size   : 20
    <8a4>   DW_AT_decl_file   : 9
    <8a5>   DW_AT_decl_line   : 75
    <8a6>   DW_AT_decl_column : 9
    <8a6>   DW_AT_sibling     : <0x8ec>
 <2><8aa>: Abbrev Number: 1 (DW_TAG_member)
    <8ab>   DW_AT_name        : (indirect string, offset: 0x2b97d): ClockType
    <8af>   DW_AT_decl_file   : 9
    <8b0>   DW_AT_decl_line   : 77
    <8b1>   DW_AT_decl_column : 12
    <8b2>   DW_AT_type        : <0xb6>
    <8b6>   DW_AT_data_member_location: 0
 <2><8b7>: Abbrev Number: 1 (DW_TAG_member)
    <8b8>   DW_AT_name        : (indirect string, offset: 0x49821): SYSCLKSource
    <8bc>   DW_AT_decl_file   : 9
    <8bd>   DW_AT_decl_line   : 80
    <8be>   DW_AT_decl_column : 12
    <8bf>   DW_AT_type        : <0xb6>
    <8c3>   DW_AT_data_member_location: 4
 <2><8c4>: Abbrev Number: 1 (DW_TAG_member)
    <8c5>   DW_AT_name        : (indirect string, offset: 0x76f58): AHBCLKDivider
    <8c9>   DW_AT_decl_file   : 9
    <8ca>   DW_AT_decl_line   : 83
    <8cb>   DW_AT_decl_column : 12
    <8cc>   DW_AT_type        : <0xb6>
    <8d0>   DW_AT_data_member_location: 8
 <2><8d1>: Abbrev Number: 1 (DW_TAG_member)
    <8d2>   DW_AT_name        : (indirect string, offset: 0x5c51): APB1CLKDivider
    <8d6>   DW_AT_decl_file   : 9
    <8d7>   DW_AT_decl_line   : 86
    <8d8>   DW_AT_decl_column : 12
    <8d9>   DW_AT_type        : <0xb6>
    <8dd>   DW_AT_data_member_location: 12
 <2><8de>: Abbrev Number: 1 (DW_TAG_member)
    <8df>   DW_AT_name        : (indirect string, offset: 0x4181b): APB2CLKDivider
    <8e3>   DW_AT_decl_file   : 9
    <8e4>   DW_AT_decl_line   : 89
    <8e5>   DW_AT_decl_column : 12
    <8e6>   DW_AT_type        : <0xb6>
    <8ea>   DW_AT_data_member_location: 16
 <2><8eb>: Abbrev Number: 0
 <1><8ec>: Abbrev Number: 3 (DW_TAG_typedef)
    <8ed>   DW_AT_name        : (indirect string, offset: 0x6f00c): RCC_ClkInitTypeDef
    <8f1>   DW_AT_decl_file   : 9
    <8f2>   DW_AT_decl_line   : 92
    <8f3>   DW_AT_decl_column : 2
    <8f4>   DW_AT_type        : <0x8a2>
 <1><8f8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <8f9>   DW_AT_byte_size   : 20
    <8fa>   DW_AT_decl_file   : 10
    <8fb>   DW_AT_decl_line   : 46
    <8fc>   DW_AT_decl_column : 9
    <8fc>   DW_AT_sibling     : <0x942>
 <2><900>: Abbrev Number: 10 (DW_TAG_member)
    <901>   DW_AT_name        : Pin
    <905>   DW_AT_decl_file   : 10
    <906>   DW_AT_decl_line   : 48
    <907>   DW_AT_decl_column : 12
    <908>   DW_AT_type        : <0xb6>
    <90c>   DW_AT_data_member_location: 0
 <2><90d>: Abbrev Number: 1 (DW_TAG_member)
    <90e>   DW_AT_name        : (indirect string, offset: 0x3d800): Mode
    <912>   DW_AT_decl_file   : 10
    <913>   DW_AT_decl_line   : 51
    <914>   DW_AT_decl_column : 12
    <915>   DW_AT_type        : <0xb6>
    <919>   DW_AT_data_member_location: 4
 <2><91a>: Abbrev Number: 1 (DW_TAG_member)
    <91b>   DW_AT_name        : (indirect string, offset: 0x4a388): Pull
    <91f>   DW_AT_decl_file   : 10
    <920>   DW_AT_decl_line   : 54
    <921>   DW_AT_decl_column : 12
    <922>   DW_AT_type        : <0xb6>
    <926>   DW_AT_data_member_location: 8
 <2><927>: Abbrev Number: 1 (DW_TAG_member)
    <928>   DW_AT_name        : (indirect string, offset: 0x5483f): Speed
    <92c>   DW_AT_decl_file   : 10
    <92d>   DW_AT_decl_line   : 57
    <92e>   DW_AT_decl_column : 12
    <92f>   DW_AT_type        : <0xb6>
    <933>   DW_AT_data_member_location: 12
 <2><934>: Abbrev Number: 1 (DW_TAG_member)
    <935>   DW_AT_name        : (indirect string, offset: 0x417dc): Alternate
    <939>   DW_AT_decl_file   : 10
    <93a>   DW_AT_decl_line   : 60
    <93b>   DW_AT_decl_column : 12
    <93c>   DW_AT_type        : <0xb6>
    <940>   DW_AT_data_member_location: 16
 <2><941>: Abbrev Number: 0
 <1><942>: Abbrev Number: 3 (DW_TAG_typedef)
    <943>   DW_AT_name        : (indirect string, offset: 0x708c8): GPIO_InitTypeDef
    <947>   DW_AT_decl_file   : 10
    <948>   DW_AT_decl_line   : 62
    <949>   DW_AT_decl_column : 2
    <94a>   DW_AT_type        : <0x8f8>
 <1><94e>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <94f>   DW_AT_encoding    : 7	(unsigned)
    <94f>   DW_AT_byte_size   : 1
    <94f>   DW_AT_type        : <0x3d>
    <953>   DW_AT_decl_file   : 10
    <954>   DW_AT_decl_line   : 68
    <955>   DW_AT_decl_column : 1
    <955>   DW_AT_sibling     : <0x966>
 <2><959>: Abbrev Number: 4 (DW_TAG_enumerator)
    <95a>   DW_AT_name        : (indirect string, offset: 0x1dc29): GPIO_PIN_RESET
    <95e>   DW_AT_const_value : 0
 <2><95f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <960>   DW_AT_name        : (indirect string, offset: 0x198b2): GPIO_PIN_SET
    <964>   DW_AT_const_value : 1
 <2><965>: Abbrev Number: 0
 <1><966>: Abbrev Number: 3 (DW_TAG_typedef)
    <967>   DW_AT_name        : (indirect string, offset: 0x8d6cf): GPIO_PinState
    <96b>   DW_AT_decl_file   : 10
    <96c>   DW_AT_decl_line   : 71
    <96d>   DW_AT_decl_column : 2
    <96e>   DW_AT_type        : <0x94e>
 <1><972>: Abbrev Number: 8 (DW_TAG_structure_type)
    <973>   DW_AT_byte_size   : 48
    <974>   DW_AT_decl_file   : 11
    <975>   DW_AT_decl_line   : 48
    <976>   DW_AT_decl_column : 9
    <976>   DW_AT_sibling     : <0xa17>
 <2><97a>: Abbrev Number: 1 (DW_TAG_member)
    <97b>   DW_AT_name        : (indirect string, offset: 0x936d4): Channel
    <97f>   DW_AT_decl_file   : 11
    <980>   DW_AT_decl_line   : 50
    <981>   DW_AT_decl_column : 12
    <982>   DW_AT_type        : <0xb6>
    <986>   DW_AT_data_member_location: 0
 <2><987>: Abbrev Number: 1 (DW_TAG_member)
    <988>   DW_AT_name        : (indirect string, offset: 0x3514c): Direction
    <98c>   DW_AT_decl_file   : 11
    <98d>   DW_AT_decl_line   : 53
    <98e>   DW_AT_decl_column : 12
    <98f>   DW_AT_type        : <0xb6>
    <993>   DW_AT_data_member_location: 4
 <2><994>: Abbrev Number: 1 (DW_TAG_member)
    <995>   DW_AT_name        : (indirect string, offset: 0x993c): PeriphInc
    <999>   DW_AT_decl_file   : 11
    <99a>   DW_AT_decl_line   : 57
    <99b>   DW_AT_decl_column : 12
    <99c>   DW_AT_type        : <0xb6>
    <9a0>   DW_AT_data_member_location: 8
 <2><9a1>: Abbrev Number: 1 (DW_TAG_member)
    <9a2>   DW_AT_name        : (indirect string, offset: 0x16d6f): MemInc
    <9a6>   DW_AT_decl_file   : 11
    <9a7>   DW_AT_decl_line   : 60
    <9a8>   DW_AT_decl_column : 12
    <9a9>   DW_AT_type        : <0xb6>
    <9ad>   DW_AT_data_member_location: 12
 <2><9ae>: Abbrev Number: 1 (DW_TAG_member)
    <9af>   DW_AT_name        : (indirect string, offset: 0x479ce): PeriphDataAlignment
    <9b3>   DW_AT_decl_file   : 11
    <9b4>   DW_AT_decl_line   : 63
    <9b5>   DW_AT_decl_column : 12
    <9b6>   DW_AT_type        : <0xb6>
    <9ba>   DW_AT_data_member_location: 16
 <2><9bb>: Abbrev Number: 1 (DW_TAG_member)
    <9bc>   DW_AT_name        : (indirect string, offset: 0x81f74): MemDataAlignment
    <9c0>   DW_AT_decl_file   : 11
    <9c1>   DW_AT_decl_line   : 66
    <9c2>   DW_AT_decl_column : 12
    <9c3>   DW_AT_type        : <0xb6>
    <9c7>   DW_AT_data_member_location: 20
 <2><9c8>: Abbrev Number: 1 (DW_TAG_member)
    <9c9>   DW_AT_name        : (indirect string, offset: 0x3d800): Mode
    <9cd>   DW_AT_decl_file   : 11
    <9ce>   DW_AT_decl_line   : 69
    <9cf>   DW_AT_decl_column : 12
    <9d0>   DW_AT_type        : <0xb6>
    <9d4>   DW_AT_data_member_location: 24
 <2><9d5>: Abbrev Number: 1 (DW_TAG_member)
    <9d6>   DW_AT_name        : (indirect string, offset: 0x93ade): Priority
    <9da>   DW_AT_decl_file   : 11
    <9db>   DW_AT_decl_line   : 74
    <9dc>   DW_AT_decl_column : 12
    <9dd>   DW_AT_type        : <0xb6>
    <9e1>   DW_AT_data_member_location: 28
 <2><9e2>: Abbrev Number: 1 (DW_TAG_member)
    <9e3>   DW_AT_name        : (indirect string, offset: 0x3d7fc): FIFOMode
    <9e7>   DW_AT_decl_file   : 11
    <9e8>   DW_AT_decl_line   : 77
    <9e9>   DW_AT_decl_column : 12
    <9ea>   DW_AT_type        : <0xb6>
    <9ee>   DW_AT_data_member_location: 32
 <2><9ef>: Abbrev Number: 1 (DW_TAG_member)
    <9f0>   DW_AT_name        : (indirect string, offset: 0x6d80f): FIFOThreshold
    <9f4>   DW_AT_decl_file   : 11
    <9f5>   DW_AT_decl_line   : 82
    <9f6>   DW_AT_decl_column : 12
    <9f7>   DW_AT_type        : <0xb6>
    <9fb>   DW_AT_data_member_location: 36
 <2><9fc>: Abbrev Number: 1 (DW_TAG_member)
    <9fd>   DW_AT_name        : (indirect string, offset: 0x6c2c1): MemBurst
    <a01>   DW_AT_decl_file   : 11
    <a02>   DW_AT_decl_line   : 85
    <a03>   DW_AT_decl_column : 12
    <a04>   DW_AT_type        : <0xb6>
    <a08>   DW_AT_data_member_location: 40
 <2><a09>: Abbrev Number: 1 (DW_TAG_member)
    <a0a>   DW_AT_name        : (indirect string, offset: 0x30f6b): PeriphBurst
    <a0e>   DW_AT_decl_file   : 11
    <a0f>   DW_AT_decl_line   : 91
    <a10>   DW_AT_decl_column : 12
    <a11>   DW_AT_type        : <0xb6>
    <a15>   DW_AT_data_member_location: 44
 <2><a16>: Abbrev Number: 0
 <1><a17>: Abbrev Number: 3 (DW_TAG_typedef)
    <a18>   DW_AT_name        : (indirect string, offset: 0x26a40): DMA_InitTypeDef
    <a1c>   DW_AT_decl_file   : 11
    <a1d>   DW_AT_decl_line   : 96
    <a1e>   DW_AT_decl_column : 2
    <a1f>   DW_AT_type        : <0x972>
 <1><a23>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <a24>   DW_AT_encoding    : 7	(unsigned)
    <a24>   DW_AT_byte_size   : 1
    <a24>   DW_AT_type        : <0x3d>
    <a28>   DW_AT_decl_file   : 11
    <a29>   DW_AT_decl_line   : 103
    <a2a>   DW_AT_decl_column : 1
    <a2a>   DW_AT_sibling     : <0xa53>
 <2><a2e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x6b8e7): HAL_DMA_STATE_RESET
    <a33>   DW_AT_const_value : 0
 <2><a34>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a35>   DW_AT_name        : (indirect string, offset: 0x2799c): HAL_DMA_STATE_READY
    <a39>   DW_AT_const_value : 1
 <2><a3a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x633f4): HAL_DMA_STATE_BUSY
    <a3f>   DW_AT_const_value : 2
 <2><a40>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a41>   DW_AT_name        : (indirect string, offset: 0x8d87e): HAL_DMA_STATE_TIMEOUT
    <a45>   DW_AT_const_value : 3
 <2><a46>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a47>   DW_AT_name        : (indirect string, offset: 0x7afee): HAL_DMA_STATE_ERROR
    <a4b>   DW_AT_const_value : 4
 <2><a4c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a4d>   DW_AT_name        : (indirect string, offset: 0x20bf7): HAL_DMA_STATE_ABORT
    <a51>   DW_AT_const_value : 5
 <2><a52>: Abbrev Number: 0
 <1><a53>: Abbrev Number: 3 (DW_TAG_typedef)
    <a54>   DW_AT_name        : (indirect string, offset: 0x4fcbd): HAL_DMA_StateTypeDef
    <a58>   DW_AT_decl_file   : 11
    <a59>   DW_AT_decl_line   : 110
    <a5a>   DW_AT_decl_column : 2
    <a5b>   DW_AT_type        : <0xa23>
 <1><a5f>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <a60>   DW_AT_type        : <0xa53>
 <1><a64>: Abbrev Number: 25 (DW_TAG_structure_type)
    <a65>   DW_AT_name        : (indirect string, offset: 0x7a4b8): __DMA_HandleTypeDef
    <a69>   DW_AT_byte_size   : 96
    <a6a>   DW_AT_decl_file   : 11
    <a6b>   DW_AT_decl_line   : 138
    <a6c>   DW_AT_decl_column : 16
    <a6c>   DW_AT_sibling     : <0xb27>
 <2><a70>: Abbrev Number: 1 (DW_TAG_member)
    <a71>   DW_AT_name        : (indirect string, offset: 0x37940): Instance
    <a75>   DW_AT_decl_file   : 11
    <a76>   DW_AT_decl_line   : 140
    <a77>   DW_AT_decl_column : 31
    <a78>   DW_AT_type        : <0xb27>
    <a7c>   DW_AT_data_member_location: 0
 <2><a7d>: Abbrev Number: 1 (DW_TAG_member)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x94390): Init
    <a82>   DW_AT_decl_file   : 11
    <a83>   DW_AT_decl_line   : 142
    <a84>   DW_AT_decl_column : 30
    <a85>   DW_AT_type        : <0xa17>
    <a89>   DW_AT_data_member_location: 4
 <2><a8a>: Abbrev Number: 1 (DW_TAG_member)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x66460): Lock
    <a8f>   DW_AT_decl_file   : 11
    <a90>   DW_AT_decl_line   : 144
    <a91>   DW_AT_decl_column : 30
    <a92>   DW_AT_type        : <0x7c3>
    <a96>   DW_AT_data_member_location: 52
 <2><a97>: Abbrev Number: 1 (DW_TAG_member)
    <a98>   DW_AT_name        : (indirect string, offset: 0x6119f): State
    <a9c>   DW_AT_decl_file   : 11
    <a9d>   DW_AT_decl_line   : 146
    <a9e>   DW_AT_decl_column : 30
    <a9f>   DW_AT_type        : <0xa5f>
    <aa3>   DW_AT_data_member_location: 53
 <2><aa4>: Abbrev Number: 1 (DW_TAG_member)
    <aa5>   DW_AT_name        : (indirect string, offset: 0x88c33): Parent
    <aa9>   DW_AT_decl_file   : 11
    <aaa>   DW_AT_decl_line   : 148
    <aab>   DW_AT_decl_column : 31
    <aac>   DW_AT_type        : <0xb2c>
    <ab0>   DW_AT_data_member_location: 56
 <2><ab1>: Abbrev Number: 1 (DW_TAG_member)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x8f2d9): XferCpltCallback
    <ab6>   DW_AT_decl_file   : 11
    <ab7>   DW_AT_decl_line   : 150
    <ab8>   DW_AT_decl_column : 33
    <ab9>   DW_AT_type        : <0xb3e>
    <abd>   DW_AT_data_member_location: 60
 <2><abe>: Abbrev Number: 1 (DW_TAG_member)
    <abf>   DW_AT_name        : (indirect string, offset: 0x6fc5f): XferHalfCpltCallback
    <ac3>   DW_AT_decl_file   : 11
    <ac4>   DW_AT_decl_line   : 152
    <ac5>   DW_AT_decl_column : 33
    <ac6>   DW_AT_type        : <0xb3e>
    <aca>   DW_AT_data_member_location: 64
 <2><acb>: Abbrev Number: 1 (DW_TAG_member)
    <acc>   DW_AT_name        : (indirect string, offset: 0x22538): XferM1CpltCallback
    <ad0>   DW_AT_decl_file   : 11
    <ad1>   DW_AT_decl_line   : 154
    <ad2>   DW_AT_decl_column : 33
    <ad3>   DW_AT_type        : <0xb3e>
    <ad7>   DW_AT_data_member_location: 68
 <2><ad8>: Abbrev Number: 1 (DW_TAG_member)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x4fef1): XferM1HalfCpltCallback
    <add>   DW_AT_decl_file   : 11
    <ade>   DW_AT_decl_line   : 156
    <adf>   DW_AT_decl_column : 33
    <ae0>   DW_AT_type        : <0xb3e>
    <ae4>   DW_AT_data_member_location: 72
 <2><ae5>: Abbrev Number: 1 (DW_TAG_member)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x151d5): XferErrorCallback
    <aea>   DW_AT_decl_file   : 11
    <aeb>   DW_AT_decl_line   : 158
    <aec>   DW_AT_decl_column : 33
    <aed>   DW_AT_type        : <0xb3e>
    <af1>   DW_AT_data_member_location: 76
 <2><af2>: Abbrev Number: 1 (DW_TAG_member)
    <af3>   DW_AT_name        : (indirect string, offset: 0x863fb): XferAbortCallback
    <af7>   DW_AT_decl_file   : 11
    <af8>   DW_AT_decl_line   : 160
    <af9>   DW_AT_decl_column : 33
    <afa>   DW_AT_type        : <0xb3e>
    <afe>   DW_AT_data_member_location: 80
 <2><aff>: Abbrev Number: 1 (DW_TAG_member)
    <b00>   DW_AT_name        : (indirect string, offset: 0x8cbba): ErrorCode
    <b04>   DW_AT_decl_file   : 11
    <b05>   DW_AT_decl_line   : 162
    <b06>   DW_AT_decl_column : 30
    <b07>   DW_AT_type        : <0xc2>
    <b0b>   DW_AT_data_member_location: 84
 <2><b0c>: Abbrev Number: 1 (DW_TAG_member)
    <b0d>   DW_AT_name        : (indirect string, offset: 0x6cd9c): StreamBaseAddress
    <b11>   DW_AT_decl_file   : 11
    <b12>   DW_AT_decl_line   : 164
    <b13>   DW_AT_decl_column : 30
    <b14>   DW_AT_type        : <0xb6>
    <b18>   DW_AT_data_member_location: 88
 <2><b19>: Abbrev Number: 1 (DW_TAG_member)
    <b1a>   DW_AT_name        : (indirect string, offset: 0x78ea5): StreamIndex
    <b1e>   DW_AT_decl_file   : 11
    <b1f>   DW_AT_decl_line   : 166
    <b20>   DW_AT_decl_column : 30
    <b21>   DW_AT_type        : <0xb6>
    <b25>   DW_AT_data_member_location: 92
 <2><b26>: Abbrev Number: 0
 <1><b27>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b28>   DW_AT_byte_size   : 4
    <b28>   DW_AT_type        : <0x254>
 <1><b2c>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <b2d>   DW_AT_byte_size   : 4
 <1><b2e>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <b2f>   DW_AT_prototyped  : 1
    <b2f>   DW_AT_sibling     : <0xb39>
 <2><b33>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b34>   DW_AT_type        : <0xb39>
 <2><b38>: Abbrev Number: 0
 <1><b39>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b3a>   DW_AT_byte_size   : 4
    <b3a>   DW_AT_type        : <0xa64>
 <1><b3e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b3f>   DW_AT_byte_size   : 4
    <b3f>   DW_AT_type        : <0xb2e>
 <1><b43>: Abbrev Number: 3 (DW_TAG_typedef)
    <b44>   DW_AT_name        : (indirect string, offset: 0x7a4ba): DMA_HandleTypeDef
    <b48>   DW_AT_decl_file   : 11
    <b49>   DW_AT_decl_line   : 168
    <b4a>   DW_AT_decl_column : 2
    <b4b>   DW_AT_type        : <0xa64>
 <1><b4f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b50>   DW_AT_byte_size   : 48
    <b51>   DW_AT_decl_file   : 12
    <b52>   DW_AT_decl_line   : 59
    <b53>   DW_AT_decl_column : 9
    <b53>   DW_AT_sibling     : <0xbf4>
 <2><b57>: Abbrev Number: 1 (DW_TAG_member)
    <b58>   DW_AT_name        : (indirect string, offset: 0x7ef91): ClockPrescaler
    <b5c>   DW_AT_decl_file   : 12
    <b5d>   DW_AT_decl_line   : 61
    <b5e>   DW_AT_decl_column : 12
    <b5f>   DW_AT_type        : <0xb6>
    <b63>   DW_AT_data_member_location: 0
 <2><b64>: Abbrev Number: 1 (DW_TAG_member)
    <b65>   DW_AT_name        : (indirect string, offset: 0xb858): Resolution
    <b69>   DW_AT_decl_file   : 12
    <b6a>   DW_AT_decl_line   : 64
    <b6b>   DW_AT_decl_column : 12
    <b6c>   DW_AT_type        : <0xb6>
    <b70>   DW_AT_data_member_location: 4
 <2><b71>: Abbrev Number: 1 (DW_TAG_member)
    <b72>   DW_AT_name        : (indirect string, offset: 0x1f43e): DataAlign
    <b76>   DW_AT_decl_file   : 12
    <b77>   DW_AT_decl_line   : 66
    <b78>   DW_AT_decl_column : 12
    <b79>   DW_AT_type        : <0xb6>
    <b7d>   DW_AT_data_member_location: 8
 <2><b7e>: Abbrev Number: 1 (DW_TAG_member)
    <b7f>   DW_AT_name        : (indirect string, offset: 0x56be0): ScanConvMode
    <b83>   DW_AT_decl_file   : 12
    <b84>   DW_AT_decl_line   : 69
    <b85>   DW_AT_decl_column : 12
    <b86>   DW_AT_type        : <0xb6>
    <b8a>   DW_AT_data_member_location: 12
 <2><b8b>: Abbrev Number: 1 (DW_TAG_member)
    <b8c>   DW_AT_name        : (indirect string, offset: 0x5f84e): EOCSelection
    <b90>   DW_AT_decl_file   : 12
    <b91>   DW_AT_decl_line   : 76
    <b92>   DW_AT_decl_column : 12
    <b93>   DW_AT_type        : <0xb6>
    <b97>   DW_AT_data_member_location: 16
 <2><b98>: Abbrev Number: 1 (DW_TAG_member)
    <b99>   DW_AT_name        : (indirect string, offset: 0x3bb81): ContinuousConvMode
    <b9d>   DW_AT_decl_file   : 12
    <b9e>   DW_AT_decl_line   : 83
    <b9f>   DW_AT_decl_column : 19
    <ba0>   DW_AT_type        : <0x768>
    <ba4>   DW_AT_data_member_location: 20
 <2><ba5>: Abbrev Number: 1 (DW_TAG_member)
    <ba6>   DW_AT_name        : (indirect string, offset: 0x9371d): NbrOfConversion
    <baa>   DW_AT_decl_file   : 12
    <bab>   DW_AT_decl_line   : 86
    <bac>   DW_AT_decl_column : 12
    <bad>   DW_AT_type        : <0xb6>
    <bb1>   DW_AT_data_member_location: 24
 <2><bb2>: Abbrev Number: 1 (DW_TAG_member)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x93844): DiscontinuousConvMode
    <bb7>   DW_AT_decl_file   : 12
    <bb8>   DW_AT_decl_line   : 89
    <bb9>   DW_AT_decl_column : 19
    <bba>   DW_AT_type        : <0x768>
    <bbe>   DW_AT_data_member_location: 28
 <2><bbf>: Abbrev Number: 1 (DW_TAG_member)
    <bc0>   DW_AT_name        : (indirect string, offset: 0x150c3): NbrOfDiscConversion
    <bc4>   DW_AT_decl_file   : 12
    <bc5>   DW_AT_decl_line   : 93
    <bc6>   DW_AT_decl_column : 12
    <bc7>   DW_AT_type        : <0xb6>
    <bcb>   DW_AT_data_member_location: 32
 <2><bcc>: Abbrev Number: 1 (DW_TAG_member)
    <bcd>   DW_AT_name        : (indirect string, offset: 0x67a2b): ExternalTrigConv
    <bd1>   DW_AT_decl_file   : 12
    <bd2>   DW_AT_decl_line   : 96
    <bd3>   DW_AT_decl_column : 12
    <bd4>   DW_AT_type        : <0xb6>
    <bd8>   DW_AT_data_member_location: 36
 <2><bd9>: Abbrev Number: 1 (DW_TAG_member)
    <bda>   DW_AT_name        : (indirect string, offset: 0x2765b): ExternalTrigConvEdge
    <bde>   DW_AT_decl_file   : 12
    <bdf>   DW_AT_decl_line   : 100
    <be0>   DW_AT_decl_column : 12
    <be1>   DW_AT_type        : <0xb6>
    <be5>   DW_AT_data_member_location: 40
 <2><be6>: Abbrev Number: 1 (DW_TAG_member)
    <be7>   DW_AT_name        : (indirect string, offset: 0x38d50): DMAContinuousRequests
    <beb>   DW_AT_decl_file   : 12
    <bec>   DW_AT_decl_line   : 103
    <bed>   DW_AT_decl_column : 19
    <bee>   DW_AT_type        : <0x768>
    <bf2>   DW_AT_data_member_location: 44
 <2><bf3>: Abbrev Number: 0
 <1><bf4>: Abbrev Number: 3 (DW_TAG_typedef)
    <bf5>   DW_AT_name        : (indirect string, offset: 0x21b2b): ADC_InitTypeDef
    <bf9>   DW_AT_decl_file   : 12
    <bfa>   DW_AT_decl_line   : 108
    <bfb>   DW_AT_decl_column : 2
    <bfc>   DW_AT_type        : <0xb4f>
 <1><c00>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c01>   DW_AT_byte_size   : 16
    <c02>   DW_AT_decl_file   : 12
    <c03>   DW_AT_decl_line   : 117
    <c04>   DW_AT_decl_column : 9
    <c04>   DW_AT_sibling     : <0xc3d>
 <2><c08>: Abbrev Number: 1 (DW_TAG_member)
    <c09>   DW_AT_name        : (indirect string, offset: 0x936d4): Channel
    <c0d>   DW_AT_decl_file   : 12
    <c0e>   DW_AT_decl_line   : 119
    <c0f>   DW_AT_decl_column : 12
    <c10>   DW_AT_type        : <0xb6>
    <c14>   DW_AT_data_member_location: 0
 <2><c15>: Abbrev Number: 1 (DW_TAG_member)
    <c16>   DW_AT_name        : (indirect string, offset: 0x93735): Rank
    <c1a>   DW_AT_decl_file   : 12
    <c1b>   DW_AT_decl_line   : 121
    <c1c>   DW_AT_decl_column : 12
    <c1d>   DW_AT_type        : <0xb6>
    <c21>   DW_AT_data_member_location: 4
 <2><c22>: Abbrev Number: 1 (DW_TAG_member)
    <c23>   DW_AT_name        : (indirect string, offset: 0x938ca): SamplingTime
    <c27>   DW_AT_decl_file   : 12
    <c28>   DW_AT_decl_line   : 123
    <c29>   DW_AT_decl_column : 12
    <c2a>   DW_AT_type        : <0xb6>
    <c2e>   DW_AT_data_member_location: 8
 <2><c2f>: Abbrev Number: 1 (DW_TAG_member)
    <c30>   DW_AT_name        : (indirect string, offset: 0x936e4): Offset
    <c34>   DW_AT_decl_file   : 12
    <c35>   DW_AT_decl_line   : 132
    <c36>   DW_AT_decl_column : 12
    <c37>   DW_AT_type        : <0xb6>
    <c3b>   DW_AT_data_member_location: 12
 <2><c3c>: Abbrev Number: 0
 <1><c3d>: Abbrev Number: 3 (DW_TAG_typedef)
    <c3e>   DW_AT_name        : (indirect string, offset: 0x8f56f): ADC_ChannelConfTypeDef
    <c42>   DW_AT_decl_file   : 12
    <c43>   DW_AT_decl_line   : 133
    <c44>   DW_AT_decl_column : 2
    <c45>   DW_AT_type        : <0xc00>
 <1><c49>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c4a>   DW_AT_byte_size   : 72
    <c4b>   DW_AT_decl_file   : 12
    <c4c>   DW_AT_decl_line   : 195
    <c4d>   DW_AT_decl_column : 9
    <c4d>   DW_AT_sibling     : <0xcad>
 <2><c51>: Abbrev Number: 1 (DW_TAG_member)
    <c52>   DW_AT_name        : (indirect string, offset: 0x37940): Instance
    <c56>   DW_AT_decl_file   : 12
    <c57>   DW_AT_decl_line   : 198
    <c58>   DW_AT_decl_column : 34
    <c59>   DW_AT_type        : <0xcad>
    <c5d>   DW_AT_data_member_location: 0
 <2><c5e>: Abbrev Number: 1 (DW_TAG_member)
    <c5f>   DW_AT_name        : (indirect string, offset: 0x94390): Init
    <c63>   DW_AT_decl_file   : 12
    <c64>   DW_AT_decl_line   : 200
    <c65>   DW_AT_decl_column : 33
    <c66>   DW_AT_type        : <0xbf4>
    <c6a>   DW_AT_data_member_location: 4
 <2><c6b>: Abbrev Number: 1 (DW_TAG_member)
    <c6c>   DW_AT_name        : (indirect string, offset: 0x25325): NbrOfCurrentConversionRank
    <c70>   DW_AT_decl_file   : 12
    <c71>   DW_AT_decl_line   : 202
    <c72>   DW_AT_decl_column : 33
    <c73>   DW_AT_type        : <0xc2>
    <c77>   DW_AT_data_member_location: 52
 <2><c78>: Abbrev Number: 1 (DW_TAG_member)
    <c79>   DW_AT_name        : (indirect string, offset: 0x4fa38): DMA_Handle
    <c7d>   DW_AT_decl_file   : 12
    <c7e>   DW_AT_decl_line   : 204
    <c7f>   DW_AT_decl_column : 34
    <c80>   DW_AT_type        : <0xcb2>
    <c84>   DW_AT_data_member_location: 56
 <2><c85>: Abbrev Number: 1 (DW_TAG_member)
    <c86>   DW_AT_name        : (indirect string, offset: 0x66460): Lock
    <c8a>   DW_AT_decl_file   : 12
    <c8b>   DW_AT_decl_line   : 206
    <c8c>   DW_AT_decl_column : 33
    <c8d>   DW_AT_type        : <0x7c3>
    <c91>   DW_AT_data_member_location: 60
 <2><c92>: Abbrev Number: 1 (DW_TAG_member)
    <c93>   DW_AT_name        : (indirect string, offset: 0x6119f): State
    <c97>   DW_AT_decl_file   : 12
    <c98>   DW_AT_decl_line   : 208
    <c99>   DW_AT_decl_column : 33
    <c9a>   DW_AT_type        : <0xc2>
    <c9e>   DW_AT_data_member_location: 64
 <2><c9f>: Abbrev Number: 1 (DW_TAG_member)
    <ca0>   DW_AT_name        : (indirect string, offset: 0x8cbba): ErrorCode
    <ca4>   DW_AT_decl_file   : 12
    <ca5>   DW_AT_decl_line   : 210
    <ca6>   DW_AT_decl_column : 33
    <ca7>   DW_AT_type        : <0xc2>
    <cab>   DW_AT_data_member_location: 68
 <2><cac>: Abbrev Number: 0
 <1><cad>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <cae>   DW_AT_byte_size   : 4
    <cae>   DW_AT_type        : <0x1f2>
 <1><cb2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <cb3>   DW_AT_byte_size   : 4
    <cb3>   DW_AT_type        : <0xb43>
 <1><cb7>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb8>   DW_AT_name        : (indirect string, offset: 0x1cd99): ADC_HandleTypeDef
    <cbc>   DW_AT_decl_file   : 12
    <cbd>   DW_AT_decl_line   : 220
    <cbe>   DW_AT_decl_column : 2
    <cbf>   DW_AT_type        : <0xc49>
 <1><cc3>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <cc4>   DW_AT_encoding    : 7	(unsigned)
    <cc4>   DW_AT_byte_size   : 1
    <cc4>   DW_AT_type        : <0x3d>
    <cc8>   DW_AT_decl_file   : 13
    <cc9>   DW_AT_decl_line   : 49
    <cca>   DW_AT_decl_column : 1
    <cca>   DW_AT_sibling     : <0xced>
 <2><cce>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ccf>   DW_AT_name        : (indirect string, offset: 0x6cfea): HAL_RTC_STATE_RESET
    <cd3>   DW_AT_const_value : 0
 <2><cd4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd5>   DW_AT_name        : (indirect string, offset: 0x290a6): HAL_RTC_STATE_READY
    <cd9>   DW_AT_const_value : 1
 <2><cda>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cdb>   DW_AT_name        : (indirect string, offset: 0x490): HAL_RTC_STATE_BUSY
    <cdf>   DW_AT_const_value : 2
 <2><ce0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ce1>   DW_AT_name        : (indirect string, offset: 0x4e8fb): HAL_RTC_STATE_TIMEOUT
    <ce5>   DW_AT_const_value : 3
 <2><ce6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x7cc64): HAL_RTC_STATE_ERROR
    <ceb>   DW_AT_const_value : 4
 <2><cec>: Abbrev Number: 0
 <1><ced>: Abbrev Number: 3 (DW_TAG_typedef)
    <cee>   DW_AT_name        : (indirect string, offset: 0x4c299): HAL_RTCStateTypeDef
    <cf2>   DW_AT_decl_file   : 13
    <cf3>   DW_AT_decl_line   : 55
    <cf4>   DW_AT_decl_column : 3
    <cf5>   DW_AT_type        : <0xcc3>
 <1><cf9>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <cfa>   DW_AT_type        : <0xced>
 <1><cfe>: Abbrev Number: 8 (DW_TAG_structure_type)
    <cff>   DW_AT_byte_size   : 24
    <d00>   DW_AT_decl_file   : 13
    <d01>   DW_AT_decl_line   : 60
    <d02>   DW_AT_decl_column : 9
    <d02>   DW_AT_sibling     : <0xd55>
 <2><d06>: Abbrev Number: 1 (DW_TAG_member)
    <d07>   DW_AT_name        : (indirect string, offset: 0x79dc2): HourFormat
    <d0b>   DW_AT_decl_file   : 13
    <d0c>   DW_AT_decl_line   : 62
    <d0d>   DW_AT_decl_column : 12
    <d0e>   DW_AT_type        : <0xb6>
    <d12>   DW_AT_data_member_location: 0
 <2><d13>: Abbrev Number: 1 (DW_TAG_member)
    <d14>   DW_AT_name        : (indirect string, offset: 0x7ddcc): AsynchPrediv
    <d18>   DW_AT_decl_file   : 13
    <d19>   DW_AT_decl_line   : 65
    <d1a>   DW_AT_decl_column : 12
    <d1b>   DW_AT_type        : <0xb6>
    <d1f>   DW_AT_data_member_location: 4
 <2><d20>: Abbrev Number: 1 (DW_TAG_member)
    <d21>   DW_AT_name        : (indirect string, offset: 0x2ce98): SynchPrediv
    <d25>   DW_AT_decl_file   : 13
    <d26>   DW_AT_decl_line   : 68
    <d27>   DW_AT_decl_column : 12
    <d28>   DW_AT_type        : <0xb6>
    <d2c>   DW_AT_data_member_location: 8
 <2><d2d>: Abbrev Number: 1 (DW_TAG_member)
    <d2e>   DW_AT_name        : (indirect string, offset: 0x3991d): OutPut
    <d32>   DW_AT_decl_file   : 13
    <d33>   DW_AT_decl_line   : 71
    <d34>   DW_AT_decl_column : 12
    <d35>   DW_AT_type        : <0xb6>
    <d39>   DW_AT_data_member_location: 12
 <2><d3a>: Abbrev Number: 1 (DW_TAG_member)
    <d3b>   DW_AT_name        : (indirect string, offset: 0x1ad01): OutPutPolarity
    <d3f>   DW_AT_decl_file   : 13
    <d40>   DW_AT_decl_line   : 74
    <d41>   DW_AT_decl_column : 12
    <d42>   DW_AT_type        : <0xb6>
    <d46>   DW_AT_data_member_location: 16
 <2><d47>: Abbrev Number: 1 (DW_TAG_member)
    <d48>   DW_AT_name        : (indirect string, offset: 0x4fee6): OutPutType
    <d4c>   DW_AT_decl_file   : 13
    <d4d>   DW_AT_decl_line   : 77
    <d4e>   DW_AT_decl_column : 12
    <d4f>   DW_AT_type        : <0xb6>
    <d53>   DW_AT_data_member_location: 20
 <2><d54>: Abbrev Number: 0
 <1><d55>: Abbrev Number: 3 (DW_TAG_typedef)
    <d56>   DW_AT_name        : (indirect string, offset: 0x2833f): RTC_InitTypeDef
    <d5a>   DW_AT_decl_file   : 13
    <d5b>   DW_AT_decl_line   : 79
    <d5c>   DW_AT_decl_column : 3
    <d5d>   DW_AT_type        : <0xcfe>
 <1><d61>: Abbrev Number: 8 (DW_TAG_structure_type)
    <d62>   DW_AT_byte_size   : 32
    <d63>   DW_AT_decl_file   : 13
    <d64>   DW_AT_decl_line   : 165
    <d65>   DW_AT_decl_column : 9
    <d65>   DW_AT_sibling     : <0xd9e>
 <2><d69>: Abbrev Number: 1 (DW_TAG_member)
    <d6a>   DW_AT_name        : (indirect string, offset: 0x37940): Instance
    <d6e>   DW_AT_decl_file   : 13
    <d6f>   DW_AT_decl_line   : 168
    <d70>   DW_AT_decl_column : 32
    <d71>   DW_AT_type        : <0xd9e>
    <d75>   DW_AT_data_member_location: 0
 <2><d76>: Abbrev Number: 1 (DW_TAG_member)
    <d77>   DW_AT_name        : (indirect string, offset: 0x94390): Init
    <d7b>   DW_AT_decl_file   : 13
    <d7c>   DW_AT_decl_line   : 170
    <d7d>   DW_AT_decl_column : 31
    <d7e>   DW_AT_type        : <0xd55>
    <d82>   DW_AT_data_member_location: 4
 <2><d83>: Abbrev Number: 1 (DW_TAG_member)
    <d84>   DW_AT_name        : (indirect string, offset: 0x66460): Lock
    <d88>   DW_AT_decl_file   : 13
    <d89>   DW_AT_decl_line   : 172
    <d8a>   DW_AT_decl_column : 31
    <d8b>   DW_AT_type        : <0x7c3>
    <d8f>   DW_AT_data_member_location: 28
 <2><d90>: Abbrev Number: 1 (DW_TAG_member)
    <d91>   DW_AT_name        : (indirect string, offset: 0x6119f): State
    <d95>   DW_AT_decl_file   : 13
    <d96>   DW_AT_decl_line   : 174
    <d97>   DW_AT_decl_column : 31
    <d98>   DW_AT_type        : <0xcf9>
    <d9c>   DW_AT_data_member_location: 29
 <2><d9d>: Abbrev Number: 0
 <1><d9e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d9f>   DW_AT_byte_size   : 4
    <d9f>   DW_AT_type        : <0x6de>
 <1><da3>: Abbrev Number: 3 (DW_TAG_typedef)
    <da4>   DW_AT_name        : (indirect string, offset: 0x74d7): RTC_HandleTypeDef
    <da8>   DW_AT_decl_file   : 13
    <da9>   DW_AT_decl_line   : 197
    <daa>   DW_AT_decl_column : 3
    <dab>   DW_AT_type        : <0xd61>
 <1><daf>: Abbrev Number: 8 (DW_TAG_structure_type)
    <db0>   DW_AT_byte_size   : 28
    <db1>   DW_AT_decl_file   : 14
    <db2>   DW_AT_decl_line   : 46
    <db3>   DW_AT_decl_column : 9
    <db3>   DW_AT_sibling     : <0xe13>
 <2><db7>: Abbrev Number: 1 (DW_TAG_member)
    <db8>   DW_AT_name        : (indirect string, offset: 0x838f7): BaudRate
    <dbc>   DW_AT_decl_file   : 14
    <dbd>   DW_AT_decl_line   : 48
    <dbe>   DW_AT_decl_column : 12
    <dbf>   DW_AT_type        : <0xb6>
    <dc3>   DW_AT_data_member_location: 0
 <2><dc4>: Abbrev Number: 1 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x41e6): WordLength
    <dc9>   DW_AT_decl_file   : 14
    <dca>   DW_AT_decl_line   : 54
    <dcb>   DW_AT_decl_column : 12
    <dcc>   DW_AT_type        : <0xb6>
    <dd0>   DW_AT_data_member_location: 4
 <2><dd1>: Abbrev Number: 1 (DW_TAG_member)
    <dd2>   DW_AT_name        : (indirect string, offset: 0x83bc0): StopBits
    <dd6>   DW_AT_decl_file   : 14
    <dd7>   DW_AT_decl_line   : 57
    <dd8>   DW_AT_decl_column : 12
    <dd9>   DW_AT_type        : <0xb6>
    <ddd>   DW_AT_data_member_location: 8
 <2><dde>: Abbrev Number: 1 (DW_TAG_member)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x335dc): Parity
    <de3>   DW_AT_decl_file   : 14
    <de4>   DW_AT_decl_line   : 60
    <de5>   DW_AT_decl_column : 12
    <de6>   DW_AT_type        : <0xb6>
    <dea>   DW_AT_data_member_location: 12
 <2><deb>: Abbrev Number: 1 (DW_TAG_member)
    <dec>   DW_AT_name        : (indirect string, offset: 0x3d800): Mode
    <df0>   DW_AT_decl_file   : 14
    <df1>   DW_AT_decl_line   : 67
    <df2>   DW_AT_decl_column : 12
    <df3>   DW_AT_type        : <0xb6>
    <df7>   DW_AT_data_member_location: 16
 <2><df8>: Abbrev Number: 1 (DW_TAG_member)
    <df9>   DW_AT_name        : (indirect string, offset: 0x10b65): HwFlowCtl
    <dfd>   DW_AT_decl_file   : 14
    <dfe>   DW_AT_decl_line   : 70
    <dff>   DW_AT_decl_column : 12
    <e00>   DW_AT_type        : <0xb6>
    <e04>   DW_AT_data_member_location: 20
 <2><e05>: Abbrev Number: 1 (DW_TAG_member)
    <e06>   DW_AT_name        : (indirect string, offset: 0x78aa7): OverSampling
    <e0a>   DW_AT_decl_file   : 14
    <e0b>   DW_AT_decl_line   : 73
    <e0c>   DW_AT_decl_column : 12
    <e0d>   DW_AT_type        : <0xb6>
    <e11>   DW_AT_data_member_location: 24
 <2><e12>: Abbrev Number: 0
 <1><e13>: Abbrev Number: 3 (DW_TAG_typedef)
    <e14>   DW_AT_name        : (indirect string, offset: 0x28737): UART_InitTypeDef
    <e18>   DW_AT_decl_file   : 14
    <e19>   DW_AT_decl_line   : 75
    <e1a>   DW_AT_decl_column : 3
    <e1b>   DW_AT_type        : <0xdaf>
 <1><e1f>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <e20>   DW_AT_encoding    : 7	(unsigned)
    <e20>   DW_AT_byte_size   : 1
    <e20>   DW_AT_type        : <0x3d>
    <e24>   DW_AT_decl_file   : 14
    <e25>   DW_AT_decl_line   : 117
    <e26>   DW_AT_decl_column : 1
    <e26>   DW_AT_sibling     : <0xe5b>
 <2><e2a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e2b>   DW_AT_name        : (indirect string, offset: 0x548ed): HAL_UART_STATE_RESET
    <e2f>   DW_AT_const_value : 0
 <2><e30>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e31>   DW_AT_name        : (indirect string, offset: 0x10862): HAL_UART_STATE_READY
    <e35>   DW_AT_const_value : 32
 <2><e36>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e37>   DW_AT_name        : (indirect string, offset: 0x7f877): HAL_UART_STATE_BUSY
    <e3b>   DW_AT_const_value : 36
 <2><e3c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x19bf): HAL_UART_STATE_BUSY_TX
    <e41>   DW_AT_const_value : 33
 <2><e42>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e43>   DW_AT_name        : (indirect string, offset: 0x1250): HAL_UART_STATE_BUSY_RX
    <e47>   DW_AT_const_value : 34
 <2><e48>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e49>   DW_AT_name        : (indirect string, offset: 0x204bc): HAL_UART_STATE_BUSY_TX_RX
    <e4d>   DW_AT_const_value : 35
 <2><e4e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e4f>   DW_AT_name        : (indirect string, offset: 0x45fd6): HAL_UART_STATE_TIMEOUT
    <e53>   DW_AT_const_value : 160
 <2><e54>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e55>   DW_AT_name        : (indirect string, offset: 0x63bfb): HAL_UART_STATE_ERROR
    <e59>   DW_AT_const_value : 224
 <2><e5a>: Abbrev Number: 0
 <1><e5b>: Abbrev Number: 3 (DW_TAG_typedef)
    <e5c>   DW_AT_name        : (indirect string, offset: 0x2b8f7): HAL_UART_StateTypeDef
    <e60>   DW_AT_decl_file   : 14
    <e61>   DW_AT_decl_line   : 135
    <e62>   DW_AT_decl_column : 3
    <e63>   DW_AT_type        : <0xe1f>
 <1><e67>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <e68>   DW_AT_type        : <0xe5b>
 <1><e6c>: Abbrev Number: 3 (DW_TAG_typedef)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x3a62a): HAL_UART_RxTypeTypeDef
    <e71>   DW_AT_decl_file   : 14
    <e72>   DW_AT_decl_line   : 144
    <e73>   DW_AT_decl_column : 18
    <e74>   DW_AT_type        : <0xb6>
 <1><e78>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <e79>   DW_AT_type        : <0xe6c>
 <1><e7d>: Abbrev Number: 25 (DW_TAG_structure_type)
    <e7e>   DW_AT_name        : (indirect string, offset: 0x53bfc): __UART_HandleTypeDef
    <e82>   DW_AT_byte_size   : 68
    <e83>   DW_AT_decl_file   : 14
    <e84>   DW_AT_decl_line   : 149
    <e85>   DW_AT_decl_column : 16
    <e85>   DW_AT_sibling     : <0xf4d>
 <2><e89>: Abbrev Number: 1 (DW_TAG_member)
    <e8a>   DW_AT_name        : (indirect string, offset: 0x37940): Instance
    <e8e>   DW_AT_decl_file   : 14
    <e8f>   DW_AT_decl_line   : 151
    <e90>   DW_AT_decl_column : 34
    <e91>   DW_AT_type        : <0xf4d>
    <e95>   DW_AT_data_member_location: 0
 <2><e96>: Abbrev Number: 1 (DW_TAG_member)
    <e97>   DW_AT_name        : (indirect string, offset: 0x94390): Init
    <e9b>   DW_AT_decl_file   : 14
    <e9c>   DW_AT_decl_line   : 153
    <e9d>   DW_AT_decl_column : 33
    <e9e>   DW_AT_type        : <0xe13>
    <ea2>   DW_AT_data_member_location: 4
 <2><ea3>: Abbrev Number: 1 (DW_TAG_member)
    <ea4>   DW_AT_name        : (indirect string, offset: 0x44e7e): pTxBuffPtr
    <ea8>   DW_AT_decl_file   : 14
    <ea9>   DW_AT_decl_line   : 155
    <eaa>   DW_AT_decl_column : 34
    <eab>   DW_AT_type        : <0xf52>
    <eaf>   DW_AT_data_member_location: 32
 <2><eb0>: Abbrev Number: 1 (DW_TAG_member)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x441c): TxXferSize
    <eb5>   DW_AT_decl_file   : 14
    <eb6>   DW_AT_decl_line   : 157
    <eb7>   DW_AT_decl_column : 33
    <eb8>   DW_AT_type        : <0xa5>
    <ebc>   DW_AT_data_member_location: 36
 <2><ebd>: Abbrev Number: 1 (DW_TAG_member)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x45e1f): TxXferCount
    <ec2>   DW_AT_decl_file   : 14
    <ec3>   DW_AT_decl_line   : 159
    <ec4>   DW_AT_decl_column : 33
    <ec5>   DW_AT_type        : <0xb1>
    <ec9>   DW_AT_data_member_location: 38
 <2><eca>: Abbrev Number: 1 (DW_TAG_member)
    <ecb>   DW_AT_name        : (indirect string, offset: 0x858ce): pRxBuffPtr
    <ecf>   DW_AT_decl_file   : 14
    <ed0>   DW_AT_decl_line   : 161
    <ed1>   DW_AT_decl_column : 34
    <ed2>   DW_AT_type        : <0xf57>
    <ed6>   DW_AT_data_member_location: 40
 <2><ed7>: Abbrev Number: 1 (DW_TAG_member)
    <ed8>   DW_AT_name        : (indirect string, offset: 0x47a96): RxXferSize
    <edc>   DW_AT_decl_file   : 14
    <edd>   DW_AT_decl_line   : 163
    <ede>   DW_AT_decl_column : 33
    <edf>   DW_AT_type        : <0xa5>
    <ee3>   DW_AT_data_member_location: 44
 <2><ee4>: Abbrev Number: 1 (DW_TAG_member)
    <ee5>   DW_AT_name        : (indirect string, offset: 0x568a1): RxXferCount
    <ee9>   DW_AT_decl_file   : 14
    <eea>   DW_AT_decl_line   : 165
    <eeb>   DW_AT_decl_column : 33
    <eec>   DW_AT_type        : <0xb1>
    <ef0>   DW_AT_data_member_location: 46
 <2><ef1>: Abbrev Number: 1 (DW_TAG_member)
    <ef2>   DW_AT_name        : (indirect string, offset: 0x781a6): ReceptionType
    <ef6>   DW_AT_decl_file   : 14
    <ef7>   DW_AT_decl_line   : 167
    <ef8>   DW_AT_decl_column : 31
    <ef9>   DW_AT_type        : <0xe78>
    <efd>   DW_AT_data_member_location: 48
 <2><efe>: Abbrev Number: 1 (DW_TAG_member)
    <eff>   DW_AT_name        : (indirect string, offset: 0x8c2e4): hdmatx
    <f03>   DW_AT_decl_file   : 14
    <f04>   DW_AT_decl_line   : 169
    <f05>   DW_AT_decl_column : 34
    <f06>   DW_AT_type        : <0xcb2>
    <f0a>   DW_AT_data_member_location: 52
 <2><f0b>: Abbrev Number: 1 (DW_TAG_member)
    <f0c>   DW_AT_name        : (indirect string, offset: 0x8b962): hdmarx
    <f10>   DW_AT_decl_file   : 14
    <f11>   DW_AT_decl_line   : 171
    <f12>   DW_AT_decl_column : 34
    <f13>   DW_AT_type        : <0xcb2>
    <f17>   DW_AT_data_member_location: 56
 <2><f18>: Abbrev Number: 1 (DW_TAG_member)
    <f19>   DW_AT_name        : (indirect string, offset: 0x66460): Lock
    <f1d>   DW_AT_decl_file   : 14
    <f1e>   DW_AT_decl_line   : 173
    <f1f>   DW_AT_decl_column : 33
    <f20>   DW_AT_type        : <0x7c3>
    <f24>   DW_AT_data_member_location: 60
 <2><f25>: Abbrev Number: 1 (DW_TAG_member)
    <f26>   DW_AT_name        : (indirect string, offset: 0x39efc): gState
    <f2a>   DW_AT_decl_file   : 14
    <f2b>   DW_AT_decl_line   : 175
    <f2c>   DW_AT_decl_column : 33
    <f2d>   DW_AT_type        : <0xe67>
    <f31>   DW_AT_data_member_location: 61
 <2><f32>: Abbrev Number: 1 (DW_TAG_member)
    <f33>   DW_AT_name        : (indirect string, offset: 0x81aca): RxState
    <f37>   DW_AT_decl_file   : 14
    <f38>   DW_AT_decl_line   : 179
    <f39>   DW_AT_decl_column : 33
    <f3a>   DW_AT_type        : <0xe67>
    <f3e>   DW_AT_data_member_location: 62
 <2><f3f>: Abbrev Number: 1 (DW_TAG_member)
    <f40>   DW_AT_name        : (indirect string, offset: 0x8cbba): ErrorCode
    <f44>   DW_AT_decl_file   : 14
    <f45>   DW_AT_decl_line   : 182
    <f46>   DW_AT_decl_column : 33
    <f47>   DW_AT_type        : <0xc2>
    <f4b>   DW_AT_data_member_location: 64
 <2><f4c>: Abbrev Number: 0
 <1><f4d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f4e>   DW_AT_byte_size   : 4
    <f4e>   DW_AT_type        : <0x745>
 <1><f52>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f53>   DW_AT_byte_size   : 4
    <f53>   DW_AT_type        : <0xa0>
 <1><f57>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f58>   DW_AT_byte_size   : 4
    <f58>   DW_AT_type        : <0x94>
 <1><f5c>: Abbrev Number: 3 (DW_TAG_typedef)
    <f5d>   DW_AT_name        : (indirect string, offset: 0x53bfe): UART_HandleTypeDef
    <f61>   DW_AT_decl_file   : 14
    <f62>   DW_AT_decl_line   : 200
    <f63>   DW_AT_decl_column : 3
    <f64>   DW_AT_type        : <0xe7d>
 <1><f68>: Abbrev Number: 16 (DW_TAG_variable)
    <f69>   DW_AT_name        : (indirect string, offset: 0x3a354): hadc1
    <f6d>   DW_AT_decl_file   : 1
    <f6d>   DW_AT_decl_line   : 43
    <f6e>   DW_AT_decl_column : 19
    <f6f>   DW_AT_type        : <0xcb7>
    <f73>   DW_AT_external    : 1
    <f73>   DW_AT_location    : 5 byte block: 3 78 0 0 20 	(DW_OP_addr: 20000078)
 <1><f79>: Abbrev Number: 16 (DW_TAG_variable)
    <f7a>   DW_AT_name        : (indirect string, offset: 0x4cd2b): hrtc
    <f7e>   DW_AT_decl_file   : 1
    <f7e>   DW_AT_decl_line   : 45
    <f7f>   DW_AT_decl_column : 19
    <f80>   DW_AT_type        : <0xda3>
    <f84>   DW_AT_external    : 1
    <f84>   DW_AT_location    : 5 byte block: 3 c0 0 0 20 	(DW_OP_addr: 200000c0)
 <1><f8a>: Abbrev Number: 16 (DW_TAG_variable)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x4d5be): huart1
    <f8f>   DW_AT_decl_file   : 1
    <f8f>   DW_AT_decl_line   : 47
    <f90>   DW_AT_decl_column : 20
    <f91>   DW_AT_type        : <0xf5c>
    <f95>   DW_AT_external    : 1
    <f95>   DW_AT_location    : 5 byte block: 3 e0 0 0 20 	(DW_OP_addr: 200000e0)
 <1><f9b>: Abbrev Number: 16 (DW_TAG_variable)
    <f9c>   DW_AT_name        : (indirect string, offset: 0x6a709): adcvalue
    <fa0>   DW_AT_decl_file   : 1
    <fa0>   DW_AT_decl_line   : 66
    <fa1>   DW_AT_decl_column : 10
    <fa2>   DW_AT_type        : <0xb6>
    <fa6>   DW_AT_external    : 1
    <fa6>   DW_AT_location    : 5 byte block: 3 24 1 0 20 	(DW_OP_addr: 20000124)
 <1><fac>: Abbrev Number: 16 (DW_TAG_variable)
    <fad>   DW_AT_name        : (indirect string, offset: 0x48cef): adcvoltage
    <fb1>   DW_AT_decl_file   : 1
    <fb1>   DW_AT_decl_line   : 67
    <fb2>   DW_AT_decl_column : 7
    <fb3>   DW_AT_type        : <0xfbd>
    <fb7>   DW_AT_external    : 1
    <fb7>   DW_AT_location    : 5 byte block: 3 28 1 0 20 	(DW_OP_addr: 20000128)
 <1><fbd>: Abbrev Number: 9 (DW_TAG_base_type)
    <fbe>   DW_AT_byte_size   : 4
    <fbf>   DW_AT_encoding    : 4	(float)
    <fc0>   DW_AT_name        : (indirect string, offset: 0x921ea): float
 <1><fc4>: Abbrev Number: 18 (DW_TAG_array_type)
    <fc5>   DW_AT_type        : <0xfd4>
    <fc9>   DW_AT_sibling     : <0xfd4>
 <2><fcd>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <fce>   DW_AT_type        : <0x8d>
    <fd2>   DW_AT_upper_bound : 39
 <2><fd3>: Abbrev Number: 0
 <1><fd4>: Abbrev Number: 9 (DW_TAG_base_type)
    <fd5>   DW_AT_byte_size   : 1
    <fd6>   DW_AT_encoding    : 8	(unsigned char)
    <fd7>   DW_AT_name        : (indirect string, offset: 0x482cb): char
 <1><fdb>: Abbrev Number: 24 (DW_TAG_const_type)
    <fdc>   DW_AT_type        : <0xfd4>
 <1><fe0>: Abbrev Number: 30 (DW_TAG_variable)
    <fe1>   DW_AT_name        : msg
    <fe5>   DW_AT_decl_file   : 1
    <fe6>   DW_AT_decl_line   : 69
    <fe7>   DW_AT_decl_column : 6
    <fe8>   DW_AT_type        : <0xfc4>
    <fec>   DW_AT_external    : 1
    <fec>   DW_AT_location    : 5 byte block: 3 2c 1 0 20 	(DW_OP_addr: 2000012c)
 <1><ff2>: Abbrev Number: 20 (DW_TAG_subprogram)
    <ff3>   DW_AT_external    : 1
    <ff3>   DW_AT_name        : (indirect string, offset: 0x586ef): HAL_GPIO_Init
    <ff7>   DW_AT_decl_file   : 10
    <ff8>   DW_AT_decl_line   : 224
    <ff9>   DW_AT_decl_column : 7
    <ffa>   DW_AT_prototyped  : 1
    <ffa>   DW_AT_declaration : 1
    <ffa>   DW_AT_sibling     : <0x1009>
 <2><ffe>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <fff>   DW_AT_type        : <0x1009>
 <2><1003>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1004>   DW_AT_type        : <0x100e>
 <2><1008>: Abbrev Number: 0
 <1><1009>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <100a>   DW_AT_byte_size   : 4
    <100a>   DW_AT_type        : <0x2f0>
 <1><100e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <100f>   DW_AT_byte_size   : 4
    <100f>   DW_AT_type        : <0x942>
 <1><1013>: Abbrev Number: 20 (DW_TAG_subprogram)
    <1014>   DW_AT_external    : 1
    <1014>   DW_AT_name        : (indirect string, offset: 0x19ad2): HAL_GPIO_WritePin
    <1018>   DW_AT_decl_file   : 10
    <1019>   DW_AT_decl_line   : 235
    <101a>   DW_AT_decl_column : 6
    <101b>   DW_AT_prototyped  : 1
    <101b>   DW_AT_declaration : 1
    <101b>   DW_AT_sibling     : <0x102f>
 <2><101f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1020>   DW_AT_type        : <0x1009>
 <2><1024>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1025>   DW_AT_type        : <0xa5>
 <2><1029>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <102a>   DW_AT_type        : <0x966>
 <2><102e>: Abbrev Number: 0
 <1><102f>: Abbrev Number: 11 (DW_TAG_subprogram)
    <1030>   DW_AT_external    : 1
    <1030>   DW_AT_name        : (indirect string, offset: 0x671a7): HAL_UART_Init
    <1034>   DW_AT_decl_file   : 14
    <1035>   DW_AT_decl_line   : 695
    <1037>   DW_AT_decl_column : 19
    <1038>   DW_AT_prototyped  : 1
    <1038>   DW_AT_type        : <0x79f>
    <103c>   DW_AT_declaration : 1
    <103c>   DW_AT_sibling     : <0x1046>
 <2><1040>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1041>   DW_AT_type        : <0x1046>
 <2><1045>: Abbrev Number: 0
 <1><1046>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1047>   DW_AT_byte_size   : 4
    <1047>   DW_AT_type        : <0xf5c>
 <1><104b>: Abbrev Number: 11 (DW_TAG_subprogram)
    <104c>   DW_AT_external    : 1
    <104c>   DW_AT_name        : (indirect string, offset: 0x40c57): HAL_RTC_Init
    <1050>   DW_AT_decl_file   : 13
